𝙡𝙤𝙘𝙖𝙡 𝙋𝙡𝙖𝙮𝙚𝙧𝙨 = 𝙜𝙖𝙢𝙚:𝙂𝙚𝙩𝙎𝙚𝙧𝙫𝙞𝙘𝙚("𝙋𝙡𝙖𝙮𝙚𝙧𝙨")
𝙡𝙤𝙘𝙖𝙡 𝙇𝙋 = 𝙋𝙡𝙖𝙮𝙚𝙧𝙨.𝙇𝙤𝙘𝙖𝙡𝙋𝙡𝙖𝙮𝙚𝙧
𝙡𝙤𝙘𝙖𝙡 𝙒𝙤𝙧𝙠𝙨𝙥𝙖𝙘𝙚 = 𝙜𝙖𝙢𝙚:𝙂𝙚𝙩𝙎𝙚𝙧𝙫𝙞𝙘𝙚("𝙒𝙤𝙧𝙠𝙨𝙥𝙖𝙘𝙚")
𝙡𝙤𝙘𝙖𝙡 𝙍𝙪𝙣𝙎𝙚𝙧𝙫𝙞𝙘𝙚 = 𝙜𝙖𝙢𝙚:𝙂𝙚𝙩𝙎𝙚𝙧𝙫𝙞𝙘𝙚("𝙍𝙪𝙣𝙎𝙚𝙧𝙫𝙞𝙘𝙚")
𝙡𝙤𝙘𝙖𝙡 𝙏𝙬𝙚𝙚𝙣𝙎𝙚𝙧𝙫𝙞𝙘𝙚 = 𝙜𝙖𝙢𝙚:𝙂𝙚𝙩𝙎𝙚𝙧𝙫𝙞𝙘𝙚("𝙏𝙬𝙚𝙚𝙣𝙎𝙚𝙧𝙫𝙞𝙘𝙚")
𝙡𝙤𝙘𝙖𝙡 𝙐𝙄𝙎 = 𝙜𝙖𝙢𝙚:𝙂𝙚𝙩𝙎𝙚𝙧𝙫𝙞𝙘𝙚("𝙐𝙨𝙚𝙧𝙄𝙣𝙥𝙪𝙩𝙎𝙚𝙧𝙫𝙞𝙘𝙚")
𝙡𝙤𝙘𝙖𝙡 𝘾𝙤𝙧𝙚𝙂𝙪𝙞 = 𝙜𝙖𝙢𝙚:𝙂𝙚𝙩𝙎𝙚𝙧𝙫𝙞𝙘𝙚("𝘾𝙤𝙧𝙚𝙂𝙪𝙞")
𝙡𝙤𝙘𝙖𝙡 𝙍𝙚𝙥𝙡𝙞𝙘𝙖𝙩𝙚𝙙𝙎𝙩𝙤𝙧𝙖𝙜𝙚 = 𝙜𝙖𝙢𝙚:𝙂𝙚𝙩𝙎𝙚𝙧𝙫𝙞𝙘𝙚("𝙍𝙚𝙥𝙡𝙞𝙘𝙖𝙩𝙚𝙙𝙎𝙩𝙤𝙧𝙖𝙜𝙚")
 
𝙡𝙤𝙘𝙖𝙡 𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣 𝙜𝙚𝙩𝙎𝙖𝙛𝙚𝙋𝙖𝙧𝙚𝙣𝙩()
𝙡𝙤𝙘𝙖𝙡 𝙨𝙪𝙘𝙘𝙚𝙨𝙨, 𝙧𝙚𝙨𝙪𝙡𝙩 = 𝙥𝙘𝙖𝙡𝙡(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣()
𝙧𝙚𝙩𝙪𝙧𝙣 𝙜𝙚𝙩𝙝𝙪𝙞 𝙖𝙣𝙙 𝙜𝙚𝙩𝙝𝙪𝙞() 𝙤𝙧 𝘾𝙤𝙧𝙚𝙂𝙪𝙞
𝙚𝙣𝙙)
𝙧𝙚𝙩𝙪𝙧𝙣 𝙨𝙪𝙘𝙘𝙚𝙨𝙨 𝙖𝙣𝙙 𝙧𝙚𝙨𝙪𝙡𝙩 𝙤𝙧 𝙇𝙋:𝙒𝙖𝙞𝙩𝙁𝙤𝙧𝘾𝙝𝙞𝙡𝙙("𝙋𝙡𝙖𝙮𝙚𝙧𝙂𝙪𝙞")
𝙚𝙣𝙙
 
-- ============================================================
-- 𝘽-2 𝙎𝙋𝙄𝙍𝙄𝙏 𝘽𝙊𝙈𝘽𝙀𝙍 𝙓 𝘽𝙇𝘼𝙎𝙏 𝘾𝘼𝙉𝙉𝙊𝙉
-- ============================================================
 
𝙡𝙤𝙘𝙖𝙡 𝙥𝙚𝙩𝙈𝙤𝙙𝙚2 = 𝙛𝙖𝙡𝙨𝙚
𝙡𝙤𝙘𝙖𝙡 𝙛𝙡𝙮𝙞𝙣𝙜 = 𝙛𝙖𝙡𝙨𝙚
𝙡𝙤𝙘𝙖𝙡 𝙣𝙤𝙘𝙡𝙞𝙥 = 𝙛𝙖𝙡𝙨𝙚
𝙡𝙤𝙘𝙖𝙡 𝙄𝙨𝙄𝙣𝙫𝙞𝙨𝙞𝙗𝙡𝙚 = 𝙛𝙖𝙡𝙨𝙚
𝙡𝙤𝙘𝙖𝙡 𝙄𝙨𝙏𝙧𝙖𝙣𝙨𝙞𝙩𝙞𝙤𝙣𝙞𝙣𝙜 = 𝙛𝙖𝙡𝙨𝙚
𝙡𝙤𝙘𝙖𝙡 𝙞𝙨𝙍𝙚𝙡𝙤𝙖𝙙𝙞𝙣𝙜 = 𝙛𝙖𝙡𝙨𝙚
𝙡𝙤𝙘𝙖𝙡 𝙞𝙨𝙈𝙞𝙣𝙞𝙢𝙞𝙯𝙚𝙙 = 𝙛𝙖𝙡𝙨𝙚
𝙡𝙤𝙘𝙖𝙡 𝙛𝙡𝙮𝙎𝙥𝙚𝙚𝙙 = 1
𝙡𝙤𝙘𝙖𝙡 𝙫𝙑𝙚𝙘𝙩 = 0
𝙡𝙤𝙘𝙖𝙡 𝙬𝙞𝙣𝙜𝙍𝙚𝙢𝙤𝙩𝙚𝘾𝙖𝙘𝙝𝙚2 = {}
𝙡𝙤𝙘𝙖𝙡 𝙋𝙀𝙍𝙈𝘼𝙉𝙀𝙉𝙏_𝙋𝙍𝙊𝙋_𝙇𝙊𝘾𝙆 = {}
𝙡𝙤𝙘𝙖𝙡 𝙘𝙪𝙧𝙧𝙚𝙣𝙩𝘾𝙁𝙧𝙖𝙢𝙚𝙨 = {}
𝙡𝙤𝙘𝙖𝙡 𝙡𝙖𝙨𝙩𝙉𝙚𝙩𝙬𝙤𝙧𝙠𝙐𝙥𝙙𝙖𝙩𝙚 = 0
𝙡𝙤𝙘𝙖𝙡 𝙡𝙖𝙨𝙩𝘾𝙤𝙡𝙤𝙧𝙐𝙥𝙙𝙖𝙩𝙚 = 0
𝙡𝙤𝙘𝙖𝙡 𝙘𝙤𝙡𝙤𝙧𝙄𝙣𝙙𝙚𝙭2 = 1
𝙡𝙤𝙘𝙖𝙡 𝙤𝙧𝙞𝙜𝙞𝙣𝙖𝙡𝙋𝙤𝙨 = 𝙣𝙞𝙡
𝙡𝙤𝙘𝙖𝙡 𝙚𝙨𝙩𝙞𝙢𝙖𝙩𝙚𝙙𝙋𝙞𝙣𝙜 = 0.03
𝙡𝙤𝙘𝙖𝙡 𝙡𝙖𝙨𝙩𝙋𝙤𝙨𝙞𝙩𝙞𝙤𝙣 = 𝙑𝙚𝙘𝙩𝙤𝙧3.𝙯𝙚𝙧𝙤
𝙡𝙤𝙘𝙖𝙡 𝙨𝙢𝙤𝙤𝙩𝙝𝙚𝙙𝙈𝙤𝙪𝙨𝙚𝙓 = 0
𝙡𝙤𝙘𝙖𝙡 𝙘𝙪𝙧𝙧𝙚𝙣𝙩𝙍𝙤𝙡𝙡 = 0
𝙡𝙤𝙘𝙖𝙡 𝙈𝘼𝙓_𝙍𝙊𝙇𝙇 = 32
𝙡𝙤𝙘𝙖𝙡 𝙍𝙊𝙇𝙇_𝙎𝙋𝙀𝙀𝘿 = 8.5
𝙡𝙤𝙘𝙖𝙡 𝘽𝘼𝙎𝙀_𝙍𝙀𝙏𝙐𝙍𝙉_𝙎𝙋𝙀𝙀𝘿 = 18
𝙡𝙤𝙘𝙖𝙡 𝙑𝙞𝙧𝙩𝙪𝙖𝙡𝙍𝙤𝙤𝙩𝘾𝙁𝙧𝙖𝙢𝙚 = 𝘾𝙁𝙧𝙖𝙢𝙚.𝙣𝙚𝙬()
𝙡𝙤𝙘𝙖𝙡 𝙑𝙞𝙨𝙞𝙗𝙡𝙚𝙋𝙖𝙧𝙩𝙨 = {}
 
𝙡𝙤𝙘𝙖𝙡 𝙈𝘼𝙉𝙐𝘼𝙇_𝙍𝙊𝙏𝘼𝙏𝙄𝙊𝙉 = 𝙑𝙚𝙘𝙩𝙤𝙧3.𝙣𝙚𝙬(-15, 450, 18)
 
𝙡𝙤𝙘𝙖𝙡 𝘾𝙊𝙇𝙊𝙍𝙎2 = {
𝘼𝙗𝙮𝙨𝙨𝙍𝙚𝙙 = 𝘾𝙤𝙡𝙤𝙧3.𝙛𝙧𝙤𝙢𝙍𝙂𝘽(100, 0, 180),
𝘿𝙖𝙧𝙠𝘼𝙗𝙮𝙨𝙨 = 𝘾𝙤𝙡𝙤𝙧3.𝙛𝙧𝙤𝙢𝙍𝙂𝘽(30, 0, 60),
𝙑𝙤𝙞𝙙 = 𝘾𝙤𝙡𝙤𝙧3.𝙛𝙧𝙤𝙢𝙍𝙂𝘽(10, 0, 20),
𝘼𝙘𝙘𝙚𝙣𝙩 = 𝘾𝙤𝙡𝙤𝙧3.𝙛𝙧𝙤𝙢𝙍𝙂𝘽(190, 50, 255)
}
 
𝙡𝙤𝙘𝙖𝙡 𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣 𝙜𝙚𝙩𝘼𝙗𝙮𝙨𝙨𝘾𝙤𝙡𝙤𝙧2(𝙩, 𝙤𝙛𝙛𝙨𝙚𝙩)
𝙡𝙤𝙘𝙖𝙡 𝙘𝙮𝙘𝙡𝙚 = (𝙩 * 0.3 + (𝙤𝙛𝙛𝙨𝙚𝙩 * 0.1)) % 1
𝙧𝙚𝙩𝙪𝙧𝙣 𝙘𝙮𝙘𝙡𝙚 < 0.5 𝙖𝙣𝙙 𝘾𝙊𝙇𝙊𝙍𝙎2.𝘼𝙗𝙮𝙨𝙨𝙍𝙚𝙙:𝙇𝙚𝙧𝙥(𝘾𝙊𝙇𝙊𝙍𝙎2.𝘿𝙖𝙧𝙠𝘼𝙗𝙮𝙨𝙨, 𝙘𝙮𝙘𝙡𝙚 * 2) 𝙤𝙧 𝘾𝙊𝙇𝙊𝙍𝙎2.𝘿𝙖𝙧𝙠𝘼𝙗𝙮𝙨𝙨:𝙇𝙚𝙧𝙥(𝘾𝙊𝙇𝙊𝙍𝙎2.𝙑𝙤𝙞𝙙, (𝙘𝙮𝙘𝙡𝙚 - 0.5) * 2)
𝙚𝙣𝙙
 
𝙡𝙤𝙘𝙖𝙡 𝙗𝙖𝙨𝙚𝙍𝙚𝙛 = 𝘾𝙁𝙧𝙖𝙢𝙚.𝙣𝙚𝙬(22.52069854736328, 9.710467338562012, -59.55190658569336)
𝙡𝙤𝙘𝙖𝙡 𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣 𝙜𝙚𝙩𝙊𝙛𝙛(𝙗𝙖𝙨𝙚, 𝙩𝙖𝙧𝙜𝙚𝙩) 𝙧𝙚𝙩𝙪𝙧𝙣 𝙗𝙖𝙨𝙚:𝙏𝙤𝙊𝙗𝙟𝙚𝙘𝙩𝙎𝙥𝙖𝙘𝙚(𝙩𝙖𝙧𝙜𝙚𝙩) 𝙚𝙣𝙙
 
𝙡𝙤𝙘𝙖𝙡 𝘽2𝙎𝙥𝙞𝙧𝙞𝙩𝙋𝙖𝙧𝙩𝙨 = {
𝙜𝙚𝙩𝙊𝙛𝙛(𝙗𝙖𝙨𝙚𝙍𝙚𝙛, 𝘾𝙁𝙧𝙖𝙢𝙚.𝙣𝙚𝙬(22.52069854736328, 9.710467338562012, -59.55190658569336, 0.6635614633560181, -0.7153833508491516, -0.21888428926467896, -0.30724698305130005, 0.00617250707000494, -0.9516097903251648, 0.6821151375770569, 0.6987048983573914, -0.21570292115211487)),
𝙜𝙚𝙩𝙊𝙛𝙛(𝙗𝙖𝙨𝙚𝙍𝙚𝙛, 𝘾𝙁𝙧𝙖𝙢𝙚.𝙣𝙚𝙬(22.32624053955078, 9.938702583312988, -54.329063415527344, -0.6777163743972778, -0.6999667882919312, -0.22527070343494415, 0.3064582645893097, 0.0096137635409832, -0.9518354535102844, 0.6684176921844482, -0.7141124606132507, 0.20799601078033447)),
𝙜𝙚𝙩𝙊𝙛𝙛(𝙗𝙖𝙨𝙚𝙍𝙚𝙛, 𝘾𝙁𝙧𝙖𝙢𝙚.𝙣𝙚𝙬(14.988859176635742, 9.114141464233398, -60.84779739379883, 0.6986134052276611, -0.7154053449630737, -0.011652480810880661, -0.010399004444479942, 0.006129089742898941, -0.9999288320541382, 0.7154237627983093, 0.6986854076385498, -0.003156449180006388)),
𝙜𝙚𝙩𝙊𝙛𝙛(𝙗𝙖𝙨𝙚𝙍𝙚𝙛, 𝘾𝙁𝙧𝙖𝙢𝙚.𝙣𝙚𝙬(10.067813873291016, 9.147733688354492, -64.95706176757812, 0.6986134052276611, -0.7154066562652588, -0.011653997004032135, -0.010398615151643753, 0.006127409636974335, -0.9999314546585083, 0.7154237627983093, 0.6986880302429199, -0.0031555527821183205)),
𝙜𝙚𝙩𝙊𝙛𝙛(𝙗𝙖𝙨𝙚𝙍𝙚𝙛, 𝘾𝙁𝙧𝙖𝙢𝙚.𝙣𝙚𝙬(12.286595344543457, 9.7159423828125, -68.07288360595703, -0.9990381002426147, 0, 0.043927405029535294, 0, 1, 0, -0.043927405029535294, 0, -0.9990381002426147)),
𝙜𝙚𝙩𝙊𝙛𝙛(𝙗𝙖𝙨𝙚𝙍𝙚𝙛, 𝘾𝙁𝙧𝙖𝙢𝙚.𝙣𝙚𝙬(9.79959487915039, 9.7159423828125, -75.73062133789062, -0.9990361928939819, 0, 0.043927282094955444, 0, 1, 0, -0.043927282094955444, 0, -0.9990361928939819)),
𝙜𝙚𝙩𝙊𝙛𝙛(𝙗𝙖𝙨𝙚𝙍𝙚𝙛, 𝘾𝙁𝙧𝙖𝙢𝙚.𝙣𝙚𝙬(7.264282703399658, 9.7159423828125, -83.42035675048828, -0.9990394115447998, 0, 0.0439273826777935, 0, 1, 0, -0.0439273826777935, 0, -0.9990394115447998)),
𝙜𝙚𝙩𝙊𝙛𝙛(𝙗𝙖𝙨𝙚𝙍𝙚𝙛, 𝘾𝙁𝙧𝙖𝙢𝙚.𝙣𝙚𝙬(11.800498962402344, 10.107032775878906, -46.31330490112305, -0.9999414682388306, -0.0019767379853874445, -0.01063547283411026, 0.0021664926316589117, -0.9998382329940796, -0.017856555059552193, -0.010598583146929741, -0.017878809943795204, 0.999783992767334)),
𝙜𝙚𝙩𝙊𝙛𝙛(𝙗𝙖𝙨𝙚𝙍𝙚𝙛, 𝘾𝙁𝙧𝙖𝙢𝙚.𝙣𝙚𝙬(8.95306396484375, 9.989402770996094, -39.134246826171875, -0.9999414682388306, -0.0019767414778470993, -0.01063548680394888, 0.002166489139199257, -0.9998382329940796, -0.01785658299922943, -0.010598569177091122, -0.017878782004117966, 0.999783992767334)),
𝙜𝙚𝙩𝙊𝙛𝙛(𝙗𝙖𝙨𝙚𝙍𝙚𝙛, 𝘾𝙁𝙧𝙖𝙢𝙚.𝙣𝙚𝙬(6.065857410430908, 9.866477012634277, -31.813827514648438, -0.9999414682388306, -0.001976743806153536, -0.010635496117174625, 0.0021664868108928204, -0.9998382329940796, -0.017856601625680923, -0.010598559863865376, -0.017878763377666473, 0.999783992767334)),
𝙜𝙚𝙩𝙊𝙛𝙛(𝙗𝙖𝙨𝙚𝙍𝙚𝙛, 𝘾𝙁𝙧𝙖𝙢𝙚.𝙣𝙚𝙬(4.723468780517578, 12.381839752197266, -67.07106018066406, -0.9994649887084961, -0.02283848449587822, 0.023504266515374184, -0.009539227932691574, 0.8888706564903259, 0.4580599069595337, -0.03135361149907112, 0.4575895667076111, -0.8886129856109619)),
𝙜𝙚𝙩𝙊𝙛𝙛(𝙗𝙖𝙨𝙚𝙍𝙚𝙛, 𝘾𝙁𝙧𝙖𝙢𝙚.𝙣𝙚𝙬(4.091357231140137, 13.507715225219727, -48.38970184326172, -0.9978439807891846, 0.06096971780061722, -0.024437841027975082, -0.0650029107928276, -0.8631194829940796, 0.5008041858673096, 0.009441127069294453, 0.5013120770454407, 0.8652169704437256)),
𝙜𝙚𝙩𝙊𝙛𝙛(𝙗𝙖𝙨𝙚𝙍𝙚𝙛, 𝘾𝙁𝙧𝙖𝙢𝙚.𝙣𝙚𝙬(9.705965042114258, 8.758496284484863, -59.43020248413086, -0.7260269522666931, -0.6833113431930542, -0.0772186890244484, 0.31255704164505005, -0.227883979678154, -0.9221583604812622, 0.6125248074531555, -0.693649411201477, 0.3790271282196045)),
𝙜𝙚𝙩𝙊𝙛𝙛(𝙗𝙖𝙨𝙚𝙍𝙚𝙛, 𝘾𝙁𝙧𝙖𝙢𝙚.𝙣𝙚𝙬(9.384881019592285, 8.827781677246094, -54.91548538208008, 0.7184293866157532, -0.6955974698066711, 0.0018433878431096673, -0.20149767398834229, -0.21065077185630798, -0.9565691947937012, 0.6657756567001343, 0.6868608593940735, -0.29150131344795227)),
𝙜𝙚𝙩𝙊𝙛𝙛(𝙗𝙖𝙨𝙚𝙍𝙚𝙛, 𝘾𝙁𝙧𝙖𝙢𝙚.𝙣𝙚𝙬(4.116398811340332, 8.579973220825195, -57.55803680419922, -0.999614953994751, 0, 0.02787942998111248, 0, 1, 0, -0.027879446744918823, 0, -0.9996143579483032))
}
 
𝙡𝙤𝙘𝙖𝙡 𝙂𝙪𝙞2 = 𝙄𝙣𝙨𝙩𝙖𝙣𝙘𝙚.𝙣𝙚𝙬("𝙎𝙘𝙧𝙚𝙚𝙣𝙂𝙪𝙞")
𝙂𝙪𝙞2.𝙉𝙖𝙢𝙚 = "𝘼𝙗𝙮𝙨𝙨_𝘽2_𝙐𝙡𝙩𝙞𝙢𝙖𝙩𝙚_𝙃𝙪𝙗"
𝙂𝙪𝙞2.𝙍𝙚𝙨𝙚𝙩𝙊𝙣𝙎𝙥𝙖𝙬𝙣 = 𝙛𝙖𝙡𝙨𝙚
𝙥𝙘𝙖𝙡𝙡(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣() 𝙂𝙪𝙞2.𝙋𝙖𝙧𝙚𝙣𝙩 = 𝙜𝙚𝙩𝙎𝙖𝙛𝙚𝙋𝙖𝙧𝙚𝙣𝙩() 𝙚𝙣𝙙)
𝙞𝙛 𝙣𝙤𝙩 𝙂𝙪𝙞2.𝙋𝙖𝙧𝙚𝙣𝙩 𝙩𝙝𝙚𝙣 𝙂𝙪𝙞2.𝙋𝙖𝙧𝙚𝙣𝙩 = 𝙇𝙋:𝙒𝙖𝙞𝙩𝙁𝙤𝙧𝘾𝙝𝙞𝙡𝙙("𝙋𝙡𝙖𝙮𝙚𝙧𝙂𝙪𝙞") 𝙚𝙣𝙙
 
𝙡𝙤𝙘𝙖𝙡 𝙢𝙖𝙞𝙣2 = 𝙄𝙣𝙨𝙩𝙖𝙣𝙘𝙚.𝙣𝙚𝙬("𝙁𝙧𝙖𝙢𝙚")
𝙢𝙖𝙞𝙣2.𝙉𝙖𝙢𝙚 = "𝙈𝙖𝙞𝙣𝙁𝙧𝙖𝙢𝙚2"
𝙢𝙖𝙞𝙣2.𝙎𝙞𝙯𝙚 = 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(0, 200, 0, 455)
𝙢𝙖𝙞𝙣2.𝙋𝙤𝙨𝙞𝙩𝙞𝙤𝙣 = 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(0.05, 0, 0.3, 0)
𝙢𝙖𝙞𝙣2.𝘽𝙖𝙘𝙠𝙜𝙧𝙤𝙪𝙣𝙙𝘾𝙤𝙡𝙤𝙧3 = 𝘾𝙤𝙡𝙤𝙧3.𝙛𝙧𝙤𝙢𝙍𝙂𝘽(15, 5, 25)
𝙢𝙖𝙞𝙣2.𝘽𝙤𝙧𝙙𝙚𝙧𝙎𝙞𝙯𝙚𝙋𝙞𝙭𝙚𝙡 = 0
𝙢𝙖𝙞𝙣2.𝘾𝙡𝙞𝙥𝙨𝘿𝙚𝙨𝙘𝙚𝙣𝙙𝙖𝙣𝙩𝙨 = 𝙩𝙧𝙪𝙚
𝙢𝙖𝙞𝙣2.𝙋𝙖𝙧𝙚𝙣𝙩 = 𝙂𝙪𝙞2
 
𝙡𝙤𝙘𝙖𝙡 𝙩𝙞𝙩𝙡𝙚𝘽𝙖𝙧2 = 𝙄𝙣𝙨𝙩𝙖𝙣𝙘𝙚.𝙣𝙚𝙬("𝙁𝙧𝙖𝙢𝙚")
𝙩𝙞𝙩𝙡𝙚𝘽𝙖𝙧2.𝙎𝙞𝙯𝙚 = 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(1, 0, 0, 30)
𝙩𝙞𝙩𝙡𝙚𝘽𝙖𝙧2.𝘽𝙖𝙘𝙠𝙜𝙧𝙤𝙪𝙣𝙙𝘾𝙤𝙡𝙤𝙧3 = 𝘾𝙊𝙇𝙊𝙍𝙎2.𝘿𝙖𝙧𝙠𝘼𝙗𝙮𝙨𝙨
𝙩𝙞𝙩𝙡𝙚𝘽𝙖𝙧2.𝘽𝙤𝙧𝙙𝙚𝙧𝙎𝙞𝙯𝙚𝙋𝙞𝙭𝙚𝙡 = 0
𝙩𝙞𝙩𝙡𝙚𝘽𝙖𝙧2.𝙋𝙖𝙧𝙚𝙣𝙩 = 𝙢𝙖𝙞𝙣2
 
𝙡𝙤𝙘𝙖𝙡 𝙩𝙞𝙩𝙡𝙚𝙇𝙖𝙗𝙚𝙡2 = 𝙄𝙣𝙨𝙩𝙖𝙣𝙘𝙚.𝙣𝙚𝙬("𝙏𝙚𝙭𝙩𝙇𝙖𝙗𝙚𝙡")
𝙩𝙞𝙩𝙡𝙚𝙇𝙖𝙗𝙚𝙡2.𝙎𝙞𝙯𝙚 = 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(1, -40, 1, 0)
𝙩𝙞𝙩𝙡𝙚𝙇𝙖𝙗𝙚𝙡2.𝙋𝙤𝙨𝙞𝙩𝙞𝙤𝙣 = 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(0, 8, 0, 0)
𝙩𝙞𝙩𝙡𝙚𝙇𝙖𝙗𝙚𝙡2.𝘽𝙖𝙘𝙠𝙜𝙧𝙤𝙪𝙣𝙙𝙏𝙧𝙖𝙣𝙨𝙥𝙖𝙧𝙚𝙣𝙘𝙮 = 1
𝙩𝙞𝙩𝙡𝙚𝙇𝙖𝙗𝙚𝙡2.𝙏𝙚𝙭𝙩 = "𝘽-2 𝙎𝙋𝙄𝙍𝙄𝙏 𝙓 𝘽𝙇𝘼𝙎𝙏 𝙃𝙐𝘽"
𝙩𝙞𝙩𝙡𝙚𝙇𝙖𝙗𝙚𝙡2.𝙏𝙚𝙭𝙩𝘾𝙤𝙡𝙤𝙧3 = 𝘾𝙤𝙡𝙤𝙧3.𝙣𝙚𝙬(1, 1, 1)
𝙩𝙞𝙩𝙡𝙚𝙇𝙖𝙗𝙚𝙡2.𝙁𝙤𝙣𝙩 = 𝙀𝙣𝙪𝙢.𝙁𝙤𝙣𝙩.𝙎𝙤𝙪𝙧𝙘𝙚𝙎𝙖𝙣𝙨𝘽𝙤𝙡𝙙
𝙩𝙞𝙩𝙡𝙚𝙇𝙖𝙗𝙚𝙡2.𝙏𝙚𝙭𝙩𝙎𝙞𝙯𝙚 = 13
𝙩𝙞𝙩𝙡𝙚𝙇𝙖𝙗𝙚𝙡2.𝙏𝙚𝙭𝙩𝙓𝘼𝙡𝙞𝙜𝙣𝙢𝙚𝙣𝙩 = 𝙀𝙣𝙪𝙢.𝙏𝙚𝙭𝙩𝙓𝘼𝙡𝙞𝙜𝙣𝙢𝙚𝙣𝙩.𝙇𝙚𝙛𝙩
𝙩𝙞𝙩𝙡𝙚𝙇𝙖𝙗𝙚𝙡2.𝙋𝙖𝙧𝙚𝙣𝙩 = 𝙩𝙞𝙩𝙡𝙚𝘽𝙖𝙧2
 
𝙡𝙤𝙘𝙖𝙡 𝙈𝙞𝙣𝘽𝙩𝙣2 = 𝙄𝙣𝙨𝙩𝙖𝙣𝙘𝙚.𝙣𝙚𝙬("𝙏𝙚𝙭𝙩𝘽𝙪𝙩𝙩𝙤𝙣")
𝙈𝙞𝙣𝘽𝙩𝙣2.𝙎𝙞𝙯𝙚 = 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(0, 22, 0, 22)
𝙈𝙞𝙣𝘽𝙩𝙣2.𝙋𝙤𝙨𝙞𝙩𝙞𝙤𝙣 = 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(1, -26, 0, 4)
𝙈𝙞𝙣𝘽𝙩𝙣2.𝘽𝙖𝙘𝙠𝙜𝙧𝙤𝙪𝙣𝙙𝘾𝙤𝙡𝙤𝙧3 = 𝘾𝙊𝙇𝙊𝙍𝙎2.𝙑𝙤𝙞𝙙
𝙈𝙞𝙣𝘽𝙩𝙣2.𝘽𝙤𝙧𝙙𝙚𝙧𝙎𝙞𝙯𝙚𝙋𝙞𝙭𝙚𝙡 = 1
𝙈𝙞𝙣𝘽𝙩𝙣2.𝘽𝙤𝙧𝙙𝙚𝙧𝘾𝙤𝙡𝙤𝙧3 = 𝘾𝙊𝙇𝙊𝙍𝙎2.𝘿𝙖𝙧𝙠𝘼𝙗𝙮𝙨𝙨
𝙈𝙞𝙣𝘽𝙩𝙣2.𝙏𝙚𝙭𝙩 = "▲"
𝙈𝙞𝙣𝘽𝙩𝙣2.𝙏𝙚𝙭𝙩𝘾𝙤𝙡𝙤𝙧3 = 𝘾𝙤𝙡𝙤𝙧3.𝙣𝙚𝙬(1, 1, 1)
𝙈𝙞𝙣𝘽𝙩𝙣2.𝙁𝙤𝙣𝙩 = 𝙀𝙣𝙪𝙢.𝙁𝙤𝙣𝙩.𝙎𝙤𝙪𝙧𝙘𝙚𝙎𝙖𝙣𝙨𝘽𝙤𝙡𝙙
𝙈𝙞𝙣𝘽𝙩𝙣2.𝙏𝙚𝙭𝙩𝙎𝙞𝙯𝙚 = 12
𝙈𝙞𝙣𝘽𝙩𝙣2.𝙋𝙖𝙧𝙚𝙣𝙩 = 𝙩𝙞𝙩𝙡𝙚𝘽𝙖𝙧2
𝙡𝙤𝙘𝙖𝙡 𝙗𝙩𝙣𝘾𝙤𝙧𝙣𝙚𝙧2 = 𝙄𝙣𝙨𝙩𝙖𝙣𝙘𝙚.𝙣𝙚𝙬("𝙐𝙄𝘾𝙤𝙧𝙣𝙚𝙧", 𝙈𝙞𝙣𝘽𝙩𝙣2)
𝙗𝙩𝙣𝘾𝙤𝙧𝙣𝙚𝙧2.𝘾𝙤𝙧𝙣𝙚𝙧𝙍𝙖𝙙𝙞𝙪𝙨 = 𝙐𝘿𝙞𝙢.𝙣𝙚𝙬(0, 4)
 
𝙡𝙤𝙘𝙖𝙡 𝙘𝙤𝙣𝙩𝙚𝙣𝙩𝘾𝙤𝙣𝙩𝙖𝙞𝙣𝙚𝙧2 = 𝙄𝙣𝙨𝙩𝙖𝙣𝙘𝙚.𝙣𝙚𝙬("𝙁𝙧𝙖𝙢𝙚")
𝙘𝙤𝙣𝙩𝙚𝙣𝙩𝘾𝙤𝙣𝙩𝙖𝙞𝙣𝙚𝙧2.𝙎𝙞𝙯𝙚 = 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(1, 0, 1, -30)
𝙘𝙤𝙣𝙩𝙚𝙣𝙩𝘾𝙤𝙣𝙩𝙖𝙞𝙣𝙚𝙧2.𝙋𝙤𝙨𝙞𝙩𝙞𝙤𝙣 = 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(0, 0, 0, 30)
𝙘𝙤𝙣𝙩𝙚𝙣𝙩𝘾𝙤𝙣𝙩𝙖𝙞𝙣𝙚𝙧2.𝘽𝙖𝙘𝙠𝙜𝙧𝙤𝙪𝙣𝙙𝙏𝙧𝙖𝙣𝙨𝙥𝙖𝙧𝙚𝙣𝙘𝙮 = 1
𝙘𝙤𝙣𝙩𝙚𝙣𝙩𝘾𝙤𝙣𝙩𝙖𝙞𝙣𝙚𝙧2.𝘾𝙡𝙞𝙥𝙨𝘿𝙚𝙨𝙘𝙚𝙣𝙙𝙖𝙣𝙩𝙨 = 𝙩𝙧𝙪𝙚
𝙘𝙤𝙣𝙩𝙚𝙣𝙩𝘾𝙤𝙣𝙩𝙖𝙞𝙣𝙚𝙧2.𝙋𝙖𝙧𝙚𝙣𝙩 = 𝙢𝙖𝙞𝙣2
 
𝙡𝙤𝙘𝙖𝙡 𝙙𝙧𝙖𝙜𝙜𝙞𝙣𝙜2, 𝙙𝙧𝙖𝙜𝙎𝙩𝙖𝙧𝙩2, 𝙨𝙩𝙖𝙧𝙩𝙋𝙤𝙨2
𝙩𝙞𝙩𝙡𝙚𝘽𝙖𝙧2.𝙄𝙣𝙥𝙪𝙩𝘽𝙚𝙜𝙖𝙣:𝘾𝙤𝙣𝙣𝙚𝙘𝙩(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣(𝙞𝙣𝙥𝙪𝙩)
𝙞𝙛 𝙞𝙣𝙥𝙪𝙩.𝙐𝙨𝙚𝙧𝙄𝙣𝙥𝙪𝙩𝙏𝙮𝙥𝙚 == 𝙀𝙣𝙪𝙢.𝙐𝙨𝙚𝙧𝙄𝙣𝙥𝙪𝙩𝙏𝙮𝙥𝙚.𝙈𝙤𝙪𝙨𝙚𝘽𝙪𝙩𝙩𝙤𝙣1 𝙤𝙧 𝙞𝙣𝙥𝙪𝙩.𝙐𝙨𝙚𝙧𝙄𝙣𝙥𝙪𝙩𝙏𝙮𝙥𝙚 == 𝙀𝙣𝙪𝙢.𝙐𝙨𝙚𝙧𝙄𝙣𝙥𝙪𝙩𝙏𝙮𝙥𝙚.𝙏𝙤𝙪𝙘𝙝 𝙩𝙝𝙚𝙣
𝙙𝙧𝙖𝙜𝙜𝙞𝙣𝙜2 = 𝙩𝙧𝙪𝙚
𝙙𝙧𝙖𝙜𝙎𝙩𝙖𝙧𝙩2 = 𝙞𝙣𝙥𝙪𝙩.𝙋𝙤𝙨𝙞𝙩𝙞𝙤𝙣
𝙨𝙩𝙖𝙧𝙩𝙋𝙤𝙨2 = 𝙢𝙖𝙞𝙣2.𝙋𝙤𝙨𝙞𝙩𝙞𝙤𝙣
𝙚𝙣𝙙
𝙚𝙣𝙙)
𝙐𝙄𝙎.𝙄𝙣𝙥𝙪𝙩𝘾𝙝𝙖𝙣𝙜𝙚𝙙:𝘾𝙤𝙣𝙣𝙚𝙘𝙩(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣(𝙞𝙣𝙥𝙪𝙩)
𝙞𝙛 𝙙𝙧𝙖𝙜𝙜𝙞𝙣𝙜2 𝙖𝙣𝙙 (𝙞𝙣𝙥𝙪𝙩.𝙐𝙨𝙚𝙧𝙄𝙣𝙥𝙪𝙩𝙏𝙮𝙥𝙚 == 𝙀𝙣𝙪𝙢.𝙐𝙨𝙚𝙧𝙄𝙣𝙥𝙪𝙩𝙏𝙮𝙥𝙚.𝙈𝙤𝙪𝙨𝙚𝙈𝙤𝙫𝙚𝙢𝙚𝙣𝙩 𝙤𝙧 𝙞𝙣𝙥𝙪𝙩.𝙐𝙨𝙚𝙧𝙄𝙣𝙥𝙪𝙩𝙏𝙮𝙥𝙚 == 𝙀𝙣𝙪𝙢.𝙐𝙨𝙚𝙧𝙄𝙣𝙥𝙪𝙩𝙏𝙮𝙥𝙚.𝙏𝙤𝙪𝙘𝙝) 𝙩𝙝𝙚𝙣
𝙡𝙤𝙘𝙖𝙡 𝙙𝙚𝙡𝙩𝙖 = 𝙞𝙣𝙥𝙪𝙩.𝙋𝙤𝙨𝙞𝙩𝙞𝙤𝙣 - 𝙙𝙧𝙖𝙜𝙎𝙩𝙖𝙧𝙩2
𝙢𝙖𝙞𝙣2.𝙋𝙤𝙨𝙞𝙩𝙞𝙤𝙣 = 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(𝙨𝙩𝙖𝙧𝙩𝙋𝙤𝙨2.𝙓.𝙎𝙘𝙖𝙡𝙚, 𝙨𝙩𝙖𝙧𝙩𝙋𝙤𝙨2.𝙓.𝙊𝙛𝙛𝙨𝙚𝙩 + 𝙙𝙚𝙡𝙩𝙖.𝙓, 𝙨𝙩𝙖𝙧𝙩𝙋𝙤𝙨2.𝙔.𝙎𝙘𝙖𝙡𝙚, 𝙨𝙩𝙖𝙧𝙩𝙋𝙤𝙨2.𝙔.𝙊𝙛𝙛𝙨𝙚𝙩 + 𝙙𝙚𝙡𝙩𝙖.𝙔)
𝙚𝙣𝙙
𝙚𝙣𝙙)
𝙐𝙄𝙎.𝙄𝙣𝙥𝙪𝙩𝙀𝙣𝙙𝙚𝙙:𝘾𝙤𝙣𝙣𝙚𝙘𝙩(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣(𝙞𝙣𝙥𝙪𝙩)
𝙞𝙛 𝙞𝙣𝙥𝙪𝙩.𝙐𝙨𝙚𝙧𝙄𝙣𝙥𝙪𝙩𝙏𝙮𝙥𝙚 == 𝙀𝙣𝙪𝙢.𝙐𝙨𝙚𝙧𝙄𝙣𝙥𝙪𝙩𝙏𝙮𝙥𝙚.𝙈𝙤𝙪𝙨𝙚𝘽𝙪𝙩𝙩𝙤𝙣1 𝙤𝙧 𝙞𝙣𝙥𝙪𝙩.𝙐𝙨𝙚𝙧𝙄𝙣𝙥𝙪𝙩𝙏𝙮𝙥𝙚 == 𝙀𝙣𝙪𝙢.𝙐𝙨𝙚𝙧𝙄𝙣𝙥𝙪𝙩𝙏𝙮𝙥𝙚.𝙏𝙤𝙪𝙘𝙝 𝙩𝙝𝙚𝙣
𝙙𝙧𝙖𝙜𝙜𝙞𝙣𝙜2 = 𝙛𝙖𝙡𝙨𝙚
𝙚𝙣𝙙
𝙚𝙣𝙙)
 
𝙡𝙤𝙘𝙖𝙡 𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣 𝙨𝙩𝙮𝙡𝙚𝘽𝙩𝙣2(𝙗)
𝙗.𝘽𝙖𝙘𝙠𝙜𝙧𝙤𝙪𝙣𝙙𝘾𝙤𝙡𝙤𝙧3 = 𝘾𝙊𝙇𝙊𝙍𝙎2.𝙑𝙤𝙞𝙙
𝙗.𝘽𝙤𝙧𝙙𝙚𝙧𝙎𝙞𝙯𝙚𝙋𝙞𝙭𝙚𝙡 = 1
𝙗.𝘽𝙤𝙧𝙙𝙚𝙧𝘾𝙤𝙡𝙤𝙧3 = 𝘾𝙊𝙇𝙊𝙍𝙎2.𝘿𝙖𝙧𝙠𝘼𝙗𝙮𝙨𝙨
𝙗.𝙏𝙚𝙭𝙩𝘾𝙤𝙡𝙤𝙧3 = 𝘾𝙤𝙡𝙤𝙧3.𝙣𝙚𝙬(0.8, 0.8, 0.8)
𝙗.𝙁𝙤𝙣𝙩 = 𝙀𝙣𝙪𝙢.𝙁𝙤𝙣𝙩.𝙎𝙤𝙪𝙧𝙘𝙚𝙎𝙖𝙣𝙨𝘽𝙤𝙡𝙙
𝙗.𝙏𝙚𝙭𝙩𝙎𝙞𝙯𝙚 = 11
𝙗.𝙈𝙤𝙪𝙨𝙚𝙀𝙣𝙩𝙚𝙧:𝘾𝙤𝙣𝙣𝙚𝙘𝙩(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣()
𝙗.𝘽𝙤𝙧𝙙𝙚𝙧𝘾𝙤𝙡𝙤𝙧3 = 𝘾𝙊𝙇𝙊𝙍𝙎2.𝘼𝙘𝙘𝙚𝙣𝙩
𝙗.𝙏𝙚𝙭𝙩𝘾𝙤𝙡𝙤𝙧3 = 𝘾𝙤𝙡𝙤𝙧3.𝙣𝙚𝙬(1, 1, 1)
𝙚𝙣𝙙)
𝙗.𝙈𝙤𝙪𝙨𝙚𝙇𝙚𝙖𝙫𝙚:𝘾𝙤𝙣𝙣𝙚𝙘𝙩(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣()
𝙗.𝘽𝙤𝙧𝙙𝙚𝙧𝘾𝙤𝙡𝙤𝙧3 = 𝘾𝙊𝙇𝙊𝙍𝙎2.𝘿𝙖𝙧𝙠𝘼𝙗𝙮𝙨𝙨
𝙗.𝙏𝙚𝙭𝙩𝘾𝙤𝙡𝙤𝙧3 = 𝘾𝙤𝙡𝙤𝙧3.𝙣𝙚𝙬(0.8, 0.8, 0.8)
𝙚𝙣𝙙)
𝙚𝙣𝙙
 
𝙡𝙤𝙘𝙖𝙡 𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣 𝙘𝙧𝙚𝙖𝙩𝙚𝘽𝙩𝙣2(𝙩𝙭𝙩, 𝙥𝙤𝙨, 𝙨𝙞𝙯𝙚, 𝙥𝙖𝙧𝙚𝙣𝙩)
𝙡𝙤𝙘𝙖𝙡 𝙗 = 𝙄𝙣𝙨𝙩𝙖𝙣𝙘𝙚.𝙣𝙚𝙬("𝙏𝙚𝙭𝙩𝘽𝙪𝙩𝙩𝙤𝙣")
𝙗.𝙏𝙚𝙭𝙩 = 𝙩𝙭𝙩
𝙗.𝙋𝙤𝙨𝙞𝙩𝙞𝙤𝙣 = 𝙥𝙤𝙨
𝙗.𝙎𝙞𝙯𝙚 = 𝙨𝙞𝙯𝙚
𝙨𝙩𝙮𝙡𝙚𝘽𝙩𝙣2(𝙗)
𝙗.𝙋𝙖𝙧𝙚𝙣𝙩 = 𝙥𝙖𝙧𝙚𝙣𝙩 𝙤𝙧 𝙘𝙤𝙣𝙩𝙚𝙣𝙩𝘾𝙤𝙣𝙩𝙖𝙞𝙣𝙚𝙧2
𝙧𝙚𝙩𝙪𝙧𝙣 𝙗
𝙚𝙣𝙙
 
𝙡𝙤𝙘𝙖𝙡 𝙗2𝙁𝙧𝙖𝙢𝙚 = 𝙄𝙣𝙨𝙩𝙖𝙣𝙘𝙚.𝙣𝙚𝙬("𝙁𝙧𝙖𝙢𝙚")
𝙗2𝙁𝙧𝙖𝙢𝙚.𝙎𝙞𝙯𝙚 = 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(1, -10, 0, 160)
𝙗2𝙁𝙧𝙖𝙢𝙚.𝙋𝙤𝙨𝙞𝙩𝙞𝙤𝙣 = 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(0, 5, 0, 5)
𝙗2𝙁𝙧𝙖𝙢𝙚.𝘽𝙖𝙘𝙠𝙜𝙧𝙤𝙪𝙣𝙙𝙏𝙧𝙖𝙣𝙨𝙥𝙖𝙧𝙚𝙣𝙘𝙮 = 1
𝙗2𝙁𝙧𝙖𝙢𝙚.𝙋𝙖𝙧𝙚𝙣𝙩 = 𝙘𝙤𝙣𝙩𝙚𝙣𝙩𝘾𝙤𝙣𝙩𝙖𝙞𝙣𝙚𝙧2
 
𝙡𝙤𝙘𝙖𝙡 𝙎𝙪𝙢𝙢𝙤𝙣𝘽𝙩𝙣2 = 𝙘𝙧𝙚𝙖𝙩𝙚𝘽𝙩𝙣2("𝙎𝙐𝙈𝙈𝙊𝙉 𝘽-2 𝙎𝙋𝙄𝙍𝙄𝙏", 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(0,0,0,0), 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(1,0,0.22,0), 𝙗2𝙁𝙧𝙖𝙢𝙚)
𝙡𝙤𝙘𝙖𝙡 𝙛𝘽𝙩𝙣2 = 𝙘𝙧𝙚𝙖𝙩𝙚𝘽𝙩𝙣2("𝙁𝙡𝙮: 𝙊𝙁𝙁", 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(0.5,2,0.26,0), 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(0.5,-2,0.22,0), 𝙗2𝙁𝙧𝙖𝙢𝙚)
𝙡𝙤𝙘𝙖𝙡 𝙪𝙥𝘽𝙩𝙣2 = 𝙘𝙧𝙚𝙖𝙩𝙚𝘽𝙩𝙣2("𝙐𝙋", 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(0,0,0.26,0), 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(0.25,-2,0.22,0), 𝙗2𝙁𝙧𝙖𝙢𝙚)
𝙡𝙤𝙘𝙖𝙡 𝙙𝙣𝘽𝙩𝙣2 = 𝙘𝙧𝙚𝙖𝙩𝙚𝘽𝙩𝙣2("𝘿𝙉", 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(0.25,0,0.26,0), 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(0.25,-2,0.22,0), 𝙗2𝙁𝙧𝙖𝙢𝙚)
𝙡𝙤𝙘𝙖𝙡 𝙥𝙡𝙪𝙨𝘽𝙩𝙣2 = 𝙘𝙧𝙚𝙖𝙩𝙚𝘽𝙩𝙣2("+", 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(0.5,2,0.52,0), 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(0.25,-2,0.22,0), 𝙗2𝙁𝙧𝙖𝙢𝙚)
𝙡𝙤𝙘𝙖𝙡 𝙢𝙞𝙣𝙪𝙨𝘽𝙩𝙣2 = 𝙘𝙧𝙚𝙖𝙩𝙚𝘽𝙩𝙣2("-", 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(0.75,2,0.52,0), 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(0.25,-2,0.22,0), 𝙗2𝙁𝙧𝙖𝙢𝙚)
𝙡𝙤𝙘𝙖𝙡 𝙨𝙉𝙪𝙢2 = 𝙘𝙧𝙚𝙖𝙩𝙚𝘽𝙩𝙣2("𝙎𝙋𝘿: 1", 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(0,0,0.52,0), 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(0.5,-2,0.22,0), 𝙗2𝙁𝙧𝙖𝙢𝙚)
𝙡𝙤𝙘𝙖𝙡 𝙘𝘽𝙩𝙣2 = 𝙘𝙧𝙚𝙖𝙩𝙚𝘽𝙩𝙣2("𝙉𝙤𝙘𝙡𝙞𝙥: 𝙊𝙁𝙁", 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(0,0,0.78,0), 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(1,0,0.22,0), 𝙗2𝙁𝙧𝙖𝙢𝙚)
 
𝙡𝙤𝙘𝙖𝙡 𝙡𝙞𝙣𝙚2 = 𝙄𝙣𝙨𝙩𝙖𝙣𝙘𝙚.𝙣𝙚𝙬("𝙁𝙧𝙖𝙢𝙚")
𝙡𝙞𝙣𝙚2.𝙎𝙞𝙯𝙚 = 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(1, -10, 0, 1)
𝙡𝙞𝙣𝙚2.𝙋𝙤𝙨𝙞𝙩𝙞𝙤𝙣 = 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(0, 5, 0, 175)
𝙡𝙞𝙣𝙚2.𝘽𝙖𝙘𝙠𝙜𝙧𝙤𝙪𝙣𝙙𝘾𝙤𝙡𝙤𝙧3 = 𝘾𝙊𝙇𝙊𝙍𝙎2.𝘿𝙖𝙧𝙠𝘼𝙗𝙮𝙨𝙨
𝙡𝙞𝙣𝙚2.𝘽𝙤𝙧𝙙𝙚𝙧𝙎𝙞𝙯𝙚𝙋𝙞𝙭𝙚𝙡 = 0
𝙡𝙞𝙣𝙚2.𝙋𝙖𝙧𝙚𝙣𝙩 = 𝙘𝙤𝙣𝙩𝙚𝙣𝙩𝘾𝙤𝙣𝙩𝙖𝙞𝙣𝙚𝙧2
 
𝙡𝙤𝙘𝙖𝙡 𝙗𝙤𝙢𝙗𝙁𝙧𝙖𝙢𝙚 = 𝙄𝙣𝙨𝙩𝙖𝙣𝙘𝙚.𝙣𝙚𝙬("𝙁𝙧𝙖𝙢𝙚")
𝙗𝙤𝙢𝙗𝙁𝙧𝙖𝙢𝙚.𝙎𝙞𝙯𝙚 = 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(1, -10, 0, 225)
𝙗𝙤𝙢𝙗𝙁𝙧𝙖𝙢𝙚.𝙋𝙤𝙨𝙞𝙩𝙞𝙤𝙣 = 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(0, 5, 0, 185)
𝙗𝙤𝙢𝙗𝙁𝙧𝙖𝙢𝙚.𝘽𝙖𝙘𝙠𝙜𝙧𝙤𝙪𝙣𝙙𝙏𝙧𝙖𝙣𝙨𝙥𝙖𝙧𝙚𝙣𝙘𝙮 = 1
𝙗𝙤𝙢𝙗𝙁𝙧𝙖𝙢𝙚.𝙋𝙖𝙧𝙚𝙣𝙩 = 𝙘𝙤𝙣𝙩𝙚𝙣𝙩𝘾𝙤𝙣𝙩𝙖𝙞𝙣𝙚𝙧2
 
𝙡𝙤𝙘𝙖𝙡 𝘾𝙤𝙪𝙣𝙩𝙚𝙧2 = 𝙄𝙣𝙨𝙩𝙖𝙣𝙘𝙚.𝙣𝙚𝙬("𝙏𝙚𝙭𝙩𝙇𝙖𝙗𝙚𝙡")
𝘾𝙤𝙪𝙣𝙩𝙚𝙧2.𝙎𝙞𝙯𝙚 = 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(1, 0, 0, 25)
𝘾𝙤𝙪𝙣𝙩𝙚𝙧2.𝙋𝙤𝙨𝙞𝙩𝙞𝙤𝙣 = 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(0, 0, 0, 0)
𝘾𝙤𝙪𝙣𝙩𝙚𝙧2.𝙏𝙚𝙭𝙩 = "𝘽𝙊𝙈𝘽𝙎 𝘾𝙊𝙐𝙉𝙏𝙀𝙍: 0"
𝘾𝙤𝙪𝙣𝙩𝙚𝙧2.𝙏𝙚𝙭𝙩𝘾𝙤𝙡𝙤𝙧3 = 𝘾𝙤𝙡𝙤𝙧3.𝙛𝙧𝙤𝙢𝙍𝙂𝘽(255, 255, 255)
𝘾𝙤𝙪𝙣𝙩𝙚𝙧2.𝙁𝙤𝙣𝙩 = 𝙀𝙣𝙪𝙢.𝙁𝙤𝙣𝙩.𝙎𝙤𝙪𝙧𝙘𝙚𝙎𝙖𝙣𝙨𝘽𝙤𝙡𝙙
𝘾𝙤𝙪𝙣𝙩𝙚𝙧2.𝙏𝙚𝙭𝙩𝙎𝙞𝙯𝙚 = 13
𝘾𝙤𝙪𝙣𝙩𝙚𝙧2.𝘽𝙖𝙘𝙠𝙜𝙧𝙤𝙪𝙣𝙙𝙏𝙧𝙖𝙣𝙨𝙥𝙖𝙧𝙚𝙣𝙘𝙮 = 1
𝘾𝙤𝙪𝙣𝙩𝙚𝙧2.𝙋𝙖𝙧𝙚𝙣𝙩 = 𝙗𝙤𝙢𝙗𝙁𝙧𝙖𝙢𝙚
 
𝙡𝙤𝙘𝙖𝙡 𝙗𝙍𝙚𝙡𝙤𝙖𝙙2 = 𝙘𝙧𝙚𝙖𝙩𝙚𝘽𝙩𝙣2("𝘼𝙐𝙏𝙊 𝙍𝙀𝙇𝙊𝘼𝘿 + 𝙏𝙋", 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(0,0,0.14,0), 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(1,0,0.16,0), 𝙗𝙤𝙢𝙗𝙁𝙧𝙖𝙢𝙚)
𝙡𝙤𝙘𝙖𝙡 𝙗𝙀𝙦𝙪𝙞𝙥2 = 𝙘𝙧𝙚𝙖𝙩𝙚𝘽𝙩𝙣2("𝙀𝙌𝙐𝙄𝙋 𝘼𝙇𝙇 𝘽𝙊𝙈𝘽𝙎", 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(0,0,0.33,0), 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(1,0,0.16,0), 𝙗𝙤𝙢𝙗𝙁𝙧𝙖𝙢𝙚)
𝙡𝙤𝙘𝙖𝙡 𝙗𝘽𝙡𝙖𝙨𝙩2 = 𝙘𝙧𝙚𝙖𝙩𝙚𝘽𝙩𝙣2("𝘽𝙇𝘼𝙎𝙏 𝘾𝘼𝙉𝙉𝙊𝙉", 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(0,0,0.52,0), 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(1,0,0.18,0), 𝙗𝙤𝙢𝙗𝙁𝙧𝙖𝙢𝙚)
𝙗𝘽𝙡𝙖𝙨𝙩2.𝘽𝙖𝙘𝙠𝙜𝙧𝙤𝙪𝙣𝙙𝘾𝙤𝙡𝙤𝙧3 = 𝘾𝙤𝙡𝙤𝙧3.𝙛𝙧𝙤𝙢𝙍𝙂𝘽(0, 30, 100)
 
𝙡𝙤𝙘𝙖𝙡 𝙗𝘿𝙚𝙩𝙤𝙣𝙖𝙩𝙚2 = 𝙘𝙧𝙚𝙖𝙩𝙚𝘽𝙩𝙣2("𝘿??𝙏𝙊𝙉𝘼𝙏𝙀 𝘼𝙇𝙇 𝘽𝙊𝙈𝘽𝙎", 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(0,0,0.73,0), 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(1,0,0.18,0), 𝙗𝙤𝙢𝙗𝙁𝙧𝙖𝙢𝙚)
𝙗𝘿𝙚𝙩𝙤𝙣𝙖𝙩𝙚2.𝘽𝙖𝙘𝙠𝙜𝙧𝙤𝙪𝙣𝙙𝘾𝙤𝙡𝙤𝙧3 = 𝘾𝙤𝙡𝙤𝙧3.𝙛𝙧𝙤𝙢𝙍𝙂𝘽(60, 0, 40)
 
𝙡𝙤𝙘𝙖𝙡 𝙞𝙣𝙫𝘽𝙩𝙣2 = 𝙘𝙧𝙚𝙖𝙩𝙚𝘽𝙩𝙣2("𝙄𝙉𝙑𝙄𝙎𝙄𝘽𝙇𝙀: 𝙊𝙁𝙁", 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(0,0,0.93,0), 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(1,0,0.16,0), 𝙗𝙤𝙢𝙗𝙁𝙧𝙖𝙢𝙚)
 
𝙡𝙤𝙘𝙖𝙡 𝙘𝙧𝙚𝙙𝙞𝙩𝙇𝙖𝙗𝙚𝙡2 = 𝙄𝙣𝙨𝙩𝙖𝙣𝙘𝙚.𝙣𝙚𝙬("𝙏𝙚𝙭𝙩𝙇𝙖𝙗𝙚𝙡")
𝙘𝙧𝙚𝙙𝙞𝙩𝙇𝙖𝙗𝙚𝙡2.𝙎𝙞𝙯𝙚 = 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(1, 0, 0, 15)
𝙘𝙧𝙚𝙙𝙞𝙩𝙇𝙖𝙗𝙚𝙡2.𝙋𝙤𝙨𝙞𝙩𝙞𝙤𝙣 = 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(0, 0, 1, -15)
𝙘𝙧𝙚𝙙𝙞𝙩𝙇𝙖𝙗𝙚𝙡2.𝘽𝙖𝙘𝙠𝙜𝙧𝙤𝙪𝙣𝙙𝙏𝙧𝙖𝙣𝙨𝙥𝙖𝙧𝙚𝙣𝙘𝙮 = 1
𝙘𝙧𝙚𝙙𝙞𝙩𝙇𝙖𝙗𝙚𝙡2.𝙏𝙚𝙭𝙩 = "𝙀𝙣𝙜𝙞𝙣𝙚: 𝘿𝙔𝙏𝙊𝙉_𝙩𝙭𝙩"
𝙘𝙧𝙚𝙙𝙞𝙩𝙇𝙖𝙗𝙚𝙡2.𝙏𝙚𝙭𝙩𝘾𝙤𝙡𝙤𝙧3 = 𝘾𝙊𝙇𝙊𝙍𝙎2.𝘼𝙘𝙘𝙚𝙣𝙩
𝙘𝙧𝙚𝙙𝙞𝙩𝙇𝙖𝙗𝙚𝙡2.𝙁𝙤𝙣𝙩 = 𝙀𝙣𝙪𝙢.𝙁𝙤𝙣𝙩.𝘾𝙤𝙙𝙚
𝙘𝙧𝙚𝙙𝙞𝙩𝙇𝙖𝙗𝙚𝙡2.𝙏𝙚𝙭𝙩𝙎𝙞𝙯𝙚 = 9
𝙘𝙧𝙚𝙙𝙞𝙩𝙇𝙖𝙗𝙚𝙡2.𝙋𝙖𝙧𝙚𝙣𝙩 = 𝙘𝙤𝙣𝙩𝙚𝙣𝙩𝘾𝙤𝙣𝙩𝙖𝙞𝙣𝙚𝙧2
 
𝙡𝙤𝙘𝙖𝙡 𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣 𝙜𝙚𝙩𝘽𝙤𝙢𝙗𝘾𝙤𝙪𝙣𝙩()
𝙡𝙤𝙘𝙖𝙡 𝙘𝙤𝙪𝙣𝙩 = 0
𝙡𝙤𝙘𝙖𝙡 𝙗𝙥 = 𝙇𝙋:𝙁𝙞𝙣𝙙𝙁𝙞𝙧𝙨𝙩𝘾𝙝𝙞𝙡𝙙("𝘽𝙖𝙘𝙠𝙥𝙖𝙘𝙠")
𝙡𝙤𝙘𝙖𝙡 𝙘𝙝𝙖𝙧 = 𝙇𝙋.𝘾𝙝𝙖𝙧𝙖𝙘𝙩𝙚𝙧
𝙞𝙛 𝙗𝙥 𝙩𝙝𝙚𝙣
𝙛𝙤𝙧 _, 𝙞𝙩𝙚𝙢 𝙞𝙣 𝙥𝙖𝙞𝙧𝙨(𝙗𝙥:𝙂𝙚𝙩𝘾𝙝𝙞𝙡𝙙𝙧𝙚𝙣()) 𝙙𝙤
𝙞𝙛 𝙞𝙩𝙚𝙢.𝙉𝙖𝙢𝙚 == "𝘽𝙤𝙢𝙗" 𝙩𝙝𝙚𝙣 𝙘𝙤𝙪𝙣𝙩 = 𝙘𝙤𝙪𝙣𝙩 + 1 𝙚𝙣𝙙
𝙚𝙣𝙙
𝙚𝙣𝙙
𝙞𝙛 𝙘𝙝𝙖𝙧 𝙩𝙝𝙚𝙣
𝙛𝙤𝙧 _, 𝙞𝙩𝙚𝙢 𝙞𝙣 𝙥𝙖𝙞𝙧𝙨(𝙘𝙝𝙖𝙧:𝙂𝙚𝙩𝘾𝙝𝙞𝙡𝙙𝙧𝙚𝙣()) 𝙙𝙤
𝙞𝙛 𝙞𝙩𝙚𝙢.𝙉𝙖𝙢𝙚 == "𝘽𝙤𝙢𝙗" 𝙩𝙝𝙚𝙣 𝙘𝙤𝙪𝙣𝙩 = 𝙘𝙤𝙪𝙣𝙩 + 1 𝙚𝙣𝙙
𝙚𝙣𝙙
𝙚𝙣𝙙
𝙧𝙚𝙩𝙪𝙧𝙣 𝙘𝙤𝙪𝙣𝙩
𝙚𝙣𝙙
 
𝙡𝙤𝙘𝙖𝙡 𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣 𝙎𝙚𝙩𝙪𝙥𝘾𝙝𝙖𝙧𝙖𝙘𝙩𝙚𝙧()
𝙡𝙤𝙘𝙖𝙡 𝙘𝙝𝙖𝙧 = 𝙇𝙋.𝘾𝙝𝙖𝙧𝙖𝙘𝙩𝙚𝙧 𝙤𝙧 𝙇𝙋.𝘾𝙝𝙖𝙧𝙖𝙘𝙩𝙚𝙧𝘼𝙙𝙙𝙚𝙙:𝙒𝙖𝙞𝙩()
𝙞𝙛 𝙣𝙤𝙩 𝙘𝙝𝙖𝙧 𝙩𝙝𝙚𝙣 𝙧𝙚𝙩𝙪𝙧𝙣 𝙚𝙣𝙙
𝙑𝙞𝙨𝙞𝙗𝙡𝙚𝙋𝙖𝙧𝙩𝙨 = {}
𝙛𝙤𝙧 _, 𝙙 𝙞𝙣 𝙥𝙖𝙞𝙧𝙨(𝙘𝙝𝙖𝙧:𝙂𝙚𝙩𝘿𝙚𝙨𝙘𝙚𝙣𝙙𝙖𝙣𝙩𝙨()) 𝙙𝙤
𝙞𝙛 (𝙙:𝙄𝙨𝘼("𝘽𝙖𝙨𝙚𝙋𝙖𝙧𝙩") 𝙤𝙧 𝙙:𝙄𝙨𝘼("𝘿𝙚𝙘𝙖𝙡")) 𝙖𝙣𝙙 𝙙.𝙉𝙖𝙢𝙚 ~= "𝙃𝙪𝙢𝙖𝙣𝙤𝙞𝙙𝙍𝙤𝙤𝙩𝙋𝙖𝙧𝙩" 𝙩𝙝𝙚𝙣
𝙩𝙖𝙗𝙡𝙚.𝙞𝙣𝙨𝙚𝙧𝙩(𝙑𝙞𝙨𝙞𝙗𝙡𝙚𝙋𝙖𝙧𝙩𝙨, 𝙙)
𝙚𝙣𝙙
𝙚𝙣𝙙
𝙚𝙣𝙙
 
𝙡𝙤𝙘𝙖𝙡 𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣 𝙧𝙚𝙨𝙩𝙤𝙧𝙚𝙉𝙖𝙩𝙪𝙧𝙖𝙡𝘾𝙤𝙡𝙡𝙞𝙨𝙞𝙤𝙣(𝙘𝙝𝙖𝙧)
𝙞𝙛 𝙣𝙤𝙩 𝙘𝙝𝙖𝙧 𝙩𝙝𝙚𝙣 𝙧𝙚𝙩𝙪𝙧𝙣 𝙚𝙣𝙙
𝙛𝙤𝙧 _, 𝙫 𝙞𝙣 𝙥𝙖𝙞𝙧𝙨(𝙘𝙝𝙖𝙧:𝙂𝙚𝙩𝘿𝙚𝙨𝙘𝙚𝙣𝙙𝙖𝙣𝙩𝙨()) 𝙙𝙤
𝙞𝙛 𝙫:𝙄𝙨𝘼("𝘽𝙖𝙨𝙚𝙋𝙖𝙧𝙩") 𝙩𝙝𝙚𝙣
𝙡𝙤𝙘𝙖𝙡 𝙣𝙖𝙢𝙚 = 𝙫.𝙉𝙖𝙢𝙚:𝙡𝙤𝙬𝙚𝙧()
𝙫.𝘾𝙖𝙣𝘾𝙤𝙡𝙡𝙞𝙙𝙚 = (𝙣𝙖𝙢𝙚:𝙛𝙞𝙣𝙙("𝙩𝙤𝙧𝙨𝙤") 𝙤𝙧 𝙣𝙖𝙢𝙚:𝙛𝙞𝙣𝙙("𝙧𝙤𝙤𝙩") 𝙤𝙧 𝙣𝙖𝙢𝙚:𝙛𝙞𝙣𝙙("𝙡𝙚𝙜") 𝙤𝙧 𝙣𝙖𝙢𝙚:𝙛𝙞𝙣𝙙("𝙝𝙚𝙖𝙙")) 𝙖𝙣𝙙 𝙣𝙤𝙩 𝙣𝙤𝙘𝙡𝙞𝙥
𝙚𝙣𝙙
𝙚𝙣𝙙
𝙚𝙣𝙙
 
𝙡𝙤𝙘𝙖𝙡 𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣 𝙧𝙚𝙨𝙚𝙩𝙋𝙝𝙮𝙨𝙞𝙘𝙨(𝙘𝙝𝙖𝙧)
𝙞𝙛 𝙣𝙤𝙩 𝙘𝙝𝙖𝙧 𝙩𝙝𝙚𝙣 𝙧𝙚𝙩𝙪𝙧𝙣 𝙚𝙣𝙙
𝙡𝙤𝙘𝙖𝙡 𝙝𝙪𝙢 = 𝙘𝙝𝙖𝙧:𝙁𝙞𝙣𝙙𝙁𝙞𝙧𝙨𝙩𝘾𝙝𝙞𝙡𝙙("𝙃𝙪𝙢𝙖𝙣𝙤𝙞𝙙")
𝙡𝙤𝙘𝙖𝙡 𝙧𝙤𝙤𝙩 = 𝙘𝙝𝙖𝙧:𝙁𝙞𝙣𝙙𝙁𝙞𝙧𝙨𝙩𝘾𝙝𝙞𝙡𝙙("𝙃𝙪𝙢𝙖𝙣𝙤𝙞𝙙𝙍𝙤𝙤𝙩𝙋𝙖𝙧𝙩")
𝙞𝙛 𝙝𝙪𝙢 𝙩𝙝𝙚𝙣
𝙝𝙪𝙢.𝙋𝙡𝙖𝙩𝙛𝙤𝙧𝙢𝙎𝙩𝙖𝙣𝙙 = 𝙛𝙖𝙡𝙨𝙚
𝙝𝙪𝙢:𝘾𝙝𝙖𝙣𝙜𝙚𝙎𝙩𝙖𝙩𝙚(𝙀𝙣𝙪𝙢.𝙃𝙪𝙢𝙖𝙣𝙤𝙞𝙙𝙎𝙩𝙖𝙩𝙚𝙏𝙮𝙥𝙚.𝙍𝙪𝙣𝙣𝙞𝙣𝙜)
𝙚𝙣𝙙
𝙞𝙛 𝙧𝙤𝙤𝙩 𝙩𝙝𝙚𝙣
𝙡𝙤𝙘𝙖𝙡 𝙗𝙫 = 𝙧𝙤𝙤𝙩:𝙁𝙞𝙣𝙙𝙁𝙞𝙧𝙨𝙩𝘾𝙝𝙞𝙡𝙙("𝘾𝙤𝙙𝙚𝙑𝙚𝙡")
𝙡𝙤𝙘𝙖𝙡 𝙗𝙜 = 𝙧𝙤𝙤𝙩:𝙁𝙞𝙣𝙙𝙁𝙞𝙧𝙨𝙩𝘾𝙝𝙞𝙡𝙙("𝘾𝙤𝙙𝙚𝙂𝙮𝙧𝙤")
𝙞𝙛 𝙗𝙫 𝙩𝙝𝙚𝙣 𝙗𝙫:𝘿𝙚𝙨𝙩𝙧𝙤𝙮() 𝙚𝙣𝙙
𝙞𝙛 𝙗𝙜 𝙩𝙝𝙚𝙣 𝙗𝙜:𝘿𝙚𝙨𝙩𝙧𝙤𝙮() 𝙚𝙣𝙙
𝙧𝙤𝙤𝙩.𝘼𝙨𝙨𝙚𝙢𝙗𝙡𝙮𝙇𝙞𝙣𝙚𝙖𝙧𝙑𝙚𝙡𝙤𝙘𝙞𝙩𝙮 = 𝙑𝙚𝙘𝙩𝙤𝙧3.𝙯𝙚𝙧𝙤
𝙚𝙣𝙙
𝙧𝙚𝙨𝙩𝙤𝙧𝙚𝙉𝙖𝙩𝙪𝙧𝙖𝙡𝘾𝙤𝙡𝙡𝙞𝙨𝙞𝙤𝙣(𝙘𝙝𝙖𝙧)
𝙚𝙣𝙙
 
𝙡𝙤𝙘𝙖𝙡 𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣 𝙏𝙤𝙜𝙜𝙡𝙚𝙄𝙣𝙫𝙞𝙨()
𝙞𝙛 𝙄𝙨𝙏𝙧𝙖𝙣𝙨𝙞𝙩𝙞𝙤𝙣𝙞𝙣𝙜 𝙩𝙝𝙚𝙣 𝙧𝙚𝙩𝙪𝙧𝙣 𝙚𝙣𝙙
𝙄𝙨𝙄𝙣𝙫𝙞𝙨𝙞𝙗𝙡𝙚 = 𝙣𝙤𝙩 𝙄𝙨𝙄𝙣𝙫𝙞𝙨𝙞𝙗𝙡𝙚
𝙞𝙣𝙫𝘽𝙩𝙣2.𝙏𝙚𝙭𝙩 = 𝙄𝙨𝙄𝙣𝙫𝙞𝙨𝙞𝙗𝙡𝙚 𝙖𝙣𝙙 "𝙄𝙉𝙑𝙄𝙎𝙄𝘽𝙇𝙀: 𝙊𝙉" 𝙤𝙧 "𝙄𝙉𝙑𝙄𝙎𝙄𝘽𝙇𝙀: 𝙊𝙁𝙁"
𝙞𝙣𝙫𝘽𝙩𝙣2.𝙏𝙚𝙭𝙩𝘾𝙤𝙡𝙤𝙧3 = 𝙄𝙨𝙄𝙣𝙫𝙞𝙨𝙞𝙗𝙡𝙚 𝙖𝙣𝙙 𝘾𝙊𝙇𝙊𝙍𝙎2.𝘼𝙘𝙘𝙚𝙣𝙩 𝙤𝙧 𝘾𝙤𝙡𝙤𝙧3.𝙣𝙚𝙬(0.8, 0.8, 0.8)
 
𝙡𝙤𝙘𝙖𝙡 𝙩𝙖𝙧𝙜𝙚𝙩𝙏𝙧𝙖𝙣𝙨𝙥𝙖𝙧𝙚𝙣𝙘𝙮 = 𝙄𝙨𝙄𝙣𝙫𝙞𝙨𝙞𝙗𝙡𝙚 𝙖𝙣𝙙 1 𝙤𝙧 0
𝙛𝙤𝙧 _, 𝙥𝙖𝙧𝙩 𝙞𝙣 𝙥𝙖𝙞𝙧𝙨(𝙑𝙞𝙨𝙞𝙗𝙡𝙚𝙋𝙖𝙧𝙩𝙨) 𝙙𝙤
𝙞𝙛 𝙥𝙖𝙧𝙩 𝙖𝙣𝙙 𝙥𝙖𝙧𝙩.𝙋𝙖𝙧𝙚𝙣𝙩 𝙩𝙝𝙚𝙣
𝙥𝙘𝙖𝙡𝙡(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣() 𝙥𝙖𝙧𝙩.𝙏𝙧𝙖𝙣𝙨𝙥𝙖𝙧𝙚𝙣𝙘𝙮 = 𝙩𝙖𝙧𝙜𝙚𝙩𝙏𝙧𝙖𝙣𝙨𝙥𝙖𝙧𝙚𝙣𝙘𝙮 𝙚𝙣𝙙)
𝙚𝙣𝙙
𝙚𝙣𝙙
 
𝙡𝙤𝙘𝙖𝙡 𝙘𝙝𝙖𝙧 = 𝙇𝙋.𝘾𝙝𝙖𝙧𝙖𝙘𝙩𝙚𝙧
𝙡𝙤𝙘𝙖𝙡 𝙧𝙤𝙤𝙩 = 𝙘𝙝𝙖𝙧 𝙖𝙣𝙙 𝙘𝙝𝙖𝙧:𝙁𝙞𝙣𝙙𝙁𝙞𝙧𝙨𝙩𝘾𝙝𝙞𝙡𝙙("𝙃𝙪𝙢𝙖𝙣𝙤𝙞𝙙𝙍𝙤𝙤𝙩𝙋𝙖𝙧𝙩")
 
𝙞𝙛 𝙄𝙨𝙄𝙣𝙫𝙞𝙨𝙞𝙗𝙡𝙚 𝙩𝙝𝙚𝙣
𝙞𝙛 𝙧𝙤𝙤𝙩 𝙩𝙝𝙚𝙣 𝙑𝙞𝙧𝙩𝙪𝙖𝙡𝙍𝙤𝙤𝙩𝘾𝙁𝙧𝙖𝙢𝙚 = 𝙧𝙤𝙤𝙩.𝘾𝙁𝙧𝙖𝙢𝙚 𝙚𝙣𝙙
𝙚𝙡𝙨𝙚
𝙄𝙨𝙏𝙧𝙖𝙣𝙨𝙞𝙩𝙞𝙤𝙣𝙞𝙣𝙜 = 𝙩𝙧𝙪𝙚
𝙩𝙖𝙨𝙠.𝙙𝙚𝙡𝙖𝙮(0.15, 𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣()
𝙄𝙨𝙏𝙧𝙖𝙣𝙨𝙞𝙩𝙞𝙤𝙣𝙞𝙣𝙜 = 𝙛𝙖𝙡𝙨𝙚
𝙚𝙣𝙙)
𝙚𝙣𝙙
𝙚𝙣𝙙
 
𝙎𝙪𝙢𝙢𝙤𝙣𝘽𝙩𝙣2.𝙈𝙤𝙪𝙨𝙚𝘽𝙪𝙩𝙩𝙤𝙣1𝘾𝙡𝙞𝙘𝙠:𝘾𝙤𝙣𝙣𝙚𝙘𝙩(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣()
𝙥𝙚𝙩𝙈𝙤𝙙𝙚2 = 𝙣𝙤𝙩 𝙥𝙚𝙩𝙈𝙤𝙙𝙚2
𝙞𝙛 𝙥𝙚𝙩𝙈𝙤𝙙𝙚2 𝙩𝙝𝙚𝙣
𝙎𝙚𝙩𝙪𝙥𝘾𝙝𝙖𝙧𝙖𝙘𝙩𝙚𝙧()
𝙛𝙡𝙮𝙞𝙣𝙜 = 𝙩𝙧𝙪𝙚
𝙣𝙤𝙘𝙡𝙞𝙥 = 𝙩𝙧𝙪𝙚
𝙛𝘽𝙩𝙣2.𝙏𝙚𝙭𝙩 = "𝙁𝙡𝙮: 𝙊𝙉"
𝙘𝘽𝙩𝙣2.𝙏𝙚𝙭𝙩 = "𝙉𝙤𝙘𝙡𝙞𝙥: 𝙊𝙉"
𝙎𝙪𝙢𝙢𝙤𝙣𝘽𝙩𝙣2.𝙏𝙚𝙭𝙩𝘾𝙤𝙡𝙤𝙧3 = 𝘾𝙊𝙇𝙊𝙍𝙎2.𝘼𝙘𝙘𝙚𝙣𝙩
 
𝙡𝙤𝙘𝙖𝙡 𝙬𝙨𝘾𝙤𝙢 = 𝙒𝙤𝙧𝙠𝙨𝙥𝙖𝙘𝙚:𝙁𝙞𝙣𝙙𝙁𝙞𝙧𝙨𝙩𝘾𝙝𝙞𝙡𝙙("𝙒𝙤𝙧𝙠𝙨𝙥𝙖𝙘𝙚𝘾𝙤𝙢")
𝙞𝙛 𝙣𝙤𝙩 𝙬𝙨𝘾𝙤𝙢 𝙩𝙝𝙚𝙣
𝙬𝙖𝙧𝙣("𝙒𝙤𝙧𝙠𝙨𝙥𝙖𝙘𝙚𝘾𝙤𝙢 𝙣𝙤𝙩 𝙛𝙤𝙪𝙣𝙙!")
𝙥𝙚𝙩𝙈𝙤𝙙𝙚2 = 𝙛𝙖𝙡𝙨𝙚
𝙛𝙡𝙮𝙞𝙣𝙜 = 𝙛𝙖𝙡𝙨𝙚
𝙣𝙤𝙘𝙡𝙞𝙥 = 𝙛𝙖𝙡𝙨𝙚
𝙛𝘽𝙩𝙣2.𝙏𝙚𝙭𝙩 = "𝙁𝙡𝙮: 𝙊𝙁𝙁"
𝙘𝘽𝙩𝙣2.𝙏𝙚𝙭𝙩 = "𝙉𝙤𝙘𝙡𝙞𝙥: 𝙊𝙁𝙁"
𝙎𝙪𝙢𝙢𝙤𝙣𝘽𝙩𝙣2.𝙏𝙚𝙭𝙩𝘾𝙤𝙡𝙤𝙧3 = 𝘾𝙤𝙡𝙤𝙧3.𝙣𝙚𝙬(0.8, 0.8, 0.8)
𝙧𝙚𝙩𝙪𝙧𝙣
𝙚𝙣𝙙
 
𝙡𝙤𝙘𝙖𝙡 𝙥 = 𝙬𝙨𝘾𝙤𝙢:𝙁𝙞𝙣𝙙𝙁𝙞𝙧𝙨𝙩𝘾𝙝𝙞𝙡𝙙("001_𝙏𝙧𝙖𝙛𝙛𝙞𝙘𝘾𝙤𝙣𝙚𝙨")
𝙞𝙛 𝙣𝙤𝙩 𝙥 𝙩𝙝𝙚𝙣
𝙬𝙖𝙧𝙣("001_𝙏𝙧𝙖𝙛𝙛𝙞𝙘𝘾𝙤𝙣𝙚𝙨 𝙣𝙤𝙩 𝙛𝙤𝙪𝙣𝙙!")
𝙥𝙚𝙩𝙈𝙤𝙙𝙚2 = 𝙛𝙖𝙡𝙨𝙚
𝙛𝙡𝙮𝙞𝙣𝙜 = 𝙛𝙖𝙡𝙨𝙚
𝙣𝙤𝙘𝙡𝙞𝙥 = 𝙛𝙖𝙡𝙨𝙚
𝙛𝘽𝙩𝙣2.𝙏𝙚𝙭𝙩 = "𝙁𝙡𝙮: 𝙊𝙁𝙁"
𝙘𝘽𝙩𝙣2.𝙏𝙚𝙭𝙩 = "𝙉𝙤𝙘𝙡𝙞𝙥: 𝙊𝙁𝙁"
𝙎𝙪𝙢𝙢𝙤𝙣𝘽𝙩𝙣2.𝙏𝙚𝙭𝙩𝘾𝙤𝙡𝙤𝙧3 = 𝘾𝙤𝙡𝙤𝙧3.𝙣𝙚𝙬(0.8, 0.8, 0.8)
𝙧𝙚𝙩𝙪𝙧𝙣
𝙚𝙣𝙙
 
𝙡𝙤𝙘𝙖𝙡 𝙩𝙖𝙧𝙜𝙚𝙩𝙉𝙖𝙢𝙚 = (𝙇𝙋.𝙉𝙖𝙢𝙚 == "𝙩𝙚𝙧𝙖𝙨𝙞𝙧𝙚𝙢𝙞𝙠") 𝙖𝙣𝙙 "𝙋𝙧𝙤𝙥𝙩𝙚𝙧𝙖𝙨𝙞𝙧𝙚𝙢𝙞𝙠" 𝙤𝙧 ("𝙋𝙧𝙤𝙥" .. 𝙇𝙋.𝙉𝙖𝙢𝙚)
 
𝙡𝙤𝙘𝙖𝙡 𝙧𝙖𝙬𝙋𝙧𝙤𝙥𝙨 = {}
𝙛𝙤𝙧 _, 𝙫 𝙞𝙣 𝙞𝙥𝙖𝙞𝙧𝙨(𝙥:𝙂𝙚𝙩𝘾𝙝𝙞𝙡𝙙𝙧𝙚𝙣()) 𝙙𝙤
𝙞𝙛 𝙫.𝙉𝙖𝙢𝙚 == 𝙩𝙖𝙧𝙜𝙚𝙩𝙉𝙖𝙢𝙚 𝙩𝙝𝙚𝙣 𝙩𝙖𝙗𝙡𝙚.𝙞𝙣𝙨𝙚𝙧𝙩(𝙧𝙖𝙬𝙋𝙧𝙤𝙥𝙨, 𝙫) 𝙚𝙣𝙙
𝙚𝙣𝙙
 
𝙛𝙤𝙧 𝙞𝙙, 𝙨𝙩𝙤𝙧𝙚𝙙𝙋𝙧𝙤𝙥 𝙞𝙣 𝙥𝙖𝙞𝙧𝙨(𝙋𝙀𝙍𝙈𝘼𝙉𝙀𝙉𝙏_𝙋𝙍𝙊𝙋_𝙇𝙊𝘾𝙆) 𝙙𝙤
𝙞𝙛 𝙣𝙤𝙩 𝙨𝙩𝙤𝙧𝙚𝙙𝙋𝙧𝙤𝙥 𝙤𝙧 𝙣𝙤𝙩 𝙨𝙩𝙤𝙧𝙚𝙙𝙋𝙧𝙤𝙥.𝙋𝙖𝙧𝙚𝙣𝙩 𝙩𝙝𝙚𝙣 𝙋𝙀𝙍𝙈𝘼𝙉𝙀𝙉𝙏_𝙋𝙍𝙊𝙋_𝙇𝙊𝘾𝙆[𝙞𝙙] = 𝙣𝙞𝙡 𝙚𝙣𝙙
𝙚𝙣𝙙
 
𝙛𝙤𝙧 _, 𝙥𝙧𝙤𝙥 𝙞𝙣 𝙞𝙥𝙖𝙞𝙧𝙨(𝙧𝙖𝙬𝙋𝙧𝙤𝙥𝙨) 𝙙𝙤
𝙡𝙤𝙘𝙖𝙡 𝙖𝙡𝙧𝙚𝙖𝙙𝙮𝙍𝙚𝙜𝙞𝙨𝙩𝙚𝙧𝙚𝙙 = 𝙛𝙖𝙡𝙨𝙚
𝙛𝙤𝙧 𝙞𝙙, 𝙨𝙩𝙤𝙧𝙚𝙙𝙋𝙧𝙤𝙥 𝙞𝙣 𝙥𝙖𝙞𝙧𝙨(𝙋𝙀𝙍𝙈𝘼𝙉𝙀𝙉𝙏_𝙋𝙍𝙊𝙋_𝙇𝙊𝘾𝙆) 𝙙𝙤
𝙞𝙛 𝙨𝙩𝙤𝙧𝙚𝙙𝙋𝙧𝙤𝙥 == 𝙥𝙧𝙤𝙥 𝙩𝙝𝙚𝙣 𝙖𝙡𝙧𝙚𝙖𝙙𝙮𝙍𝙚𝙜𝙞𝙨𝙩𝙚𝙧𝙚𝙙 = 𝙩𝙧𝙪𝙚 𝙗𝙧𝙚𝙖𝙠 𝙚𝙣𝙙
𝙚𝙣𝙙
𝙞𝙛 𝙣𝙤𝙩 𝙖𝙡𝙧𝙚𝙖𝙙𝙮𝙍𝙚𝙜𝙞𝙨𝙩𝙚𝙧𝙚𝙙 𝙩𝙝𝙚𝙣
𝙛𝙤𝙧 𝙞𝙙 = 1, #𝘽2𝙎𝙥𝙞𝙧𝙞𝙩𝙋𝙖𝙧𝙩𝙨 𝙙𝙤
𝙞𝙛 𝙣𝙤𝙩 𝙋𝙀𝙍𝙈𝘼𝙉𝙀𝙉𝙏_𝙋𝙍𝙊𝙋_𝙇𝙊𝘾𝙆[𝙞𝙙] 𝙩𝙝𝙚𝙣
𝙋𝙀𝙍𝙈𝘼𝙉𝙀𝙉𝙏_𝙋𝙍𝙊𝙋_𝙇𝙊𝘾𝙆[𝙞𝙙] = 𝙥𝙧𝙤𝙥
𝙗𝙧𝙚𝙖𝙠
𝙚𝙣𝙙
𝙚𝙣𝙙
𝙚𝙣𝙙
𝙚𝙣𝙙
 
𝙬𝙞𝙣𝙜𝙍𝙚𝙢𝙤𝙩𝙚𝘾𝙖𝙘𝙝𝙚2 = {}
𝙛𝙤𝙧 𝙞𝙙 = 1, #𝘽2𝙎𝙥𝙞𝙧𝙞𝙩𝙋𝙖𝙧𝙩𝙨 𝙙𝙤
𝙞𝙛 𝙋𝙀𝙍𝙈𝘼𝙉𝙀𝙉𝙏_𝙋𝙍𝙊𝙋_𝙇𝙊𝘾𝙆[𝙞𝙙] 𝙖𝙣𝙙 𝙋𝙀𝙍𝙈𝘼𝙉𝙀𝙉𝙏_𝙋𝙍𝙊𝙋_𝙇𝙊𝘾𝙆[𝙞𝙙].𝙋𝙖𝙧𝙚𝙣𝙩 𝙩𝙝𝙚𝙣
𝙩𝙖𝙗𝙡𝙚.𝙞𝙣𝙨𝙚𝙧𝙩(𝙬𝙞𝙣𝙜𝙍𝙚𝙢𝙤𝙩𝙚𝘾𝙖𝙘𝙝𝙚2, 𝙋𝙀𝙍𝙈𝘼𝙉𝙀𝙉𝙏_𝙋𝙍𝙊𝙋_𝙇𝙊𝘾𝙆[𝙞𝙙])
𝙚𝙣𝙙
𝙚𝙣𝙙
𝙚𝙡𝙨𝙚
𝙞𝙛 𝙄𝙨𝙄𝙣𝙫𝙞𝙨𝙞𝙗𝙡𝙚 𝙩𝙝𝙚𝙣 𝙏𝙤𝙜𝙜𝙡𝙚𝙄𝙣𝙫𝙞𝙨() 𝙚𝙣𝙙
𝙛𝙡𝙮𝙞𝙣𝙜 = 𝙛𝙖𝙡𝙨𝙚
𝙣𝙤𝙘𝙡𝙞𝙥 = 𝙛𝙖𝙡𝙨𝙚
𝙛𝘽𝙩𝙣2.𝙏𝙚𝙭𝙩 = "𝙁𝙡𝙮: 𝙊𝙁𝙁"
𝙘𝘽𝙩𝙣2.𝙏𝙚𝙭𝙩 = "𝙉𝙤𝙘𝙡𝙞𝙥: 𝙊𝙁𝙁"
𝙎𝙪𝙢𝙢𝙤𝙣𝘽𝙩𝙣2.𝙏𝙚𝙭𝙩𝘾𝙤𝙡𝙤𝙧3 = 𝘾𝙤𝙡𝙤𝙧3.𝙣𝙚𝙬(0.8, 0.8, 0.8)
𝙧𝙚𝙨𝙚𝙩𝙋𝙝𝙮𝙨𝙞𝙘𝙨(𝙇𝙋.𝘾𝙝𝙖𝙧𝙖𝙘𝙩𝙚𝙧)
𝙩𝙖𝙗𝙡𝙚.𝙘𝙡𝙚𝙖𝙧(𝙘𝙪𝙧𝙧𝙚𝙣𝙩𝘾𝙁𝙧𝙖𝙢𝙚𝙨)
𝙘𝙪𝙧𝙧𝙚𝙣𝙩𝙍𝙤𝙡𝙡 = 0
𝙚𝙣𝙙
𝙚𝙣𝙙)
 
𝙛𝘽𝙩𝙣2.𝙈𝙤𝙪𝙨𝙚𝘽𝙪𝙩𝙩𝙤𝙣1𝘾𝙡𝙞𝙘𝙠:𝘾𝙤𝙣𝙣𝙚𝙘𝙩(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣()
𝙛𝙡𝙮𝙞𝙣𝙜 = 𝙣𝙤𝙩 𝙛𝙡𝙮𝙞𝙣𝙜
𝙛𝘽𝙩𝙣2.𝙏𝙚𝙭𝙩 = 𝙛𝙡𝙮𝙞𝙣𝙜 𝙖𝙣𝙙 "𝙁𝙡𝙮: 𝙊𝙉" 𝙤𝙧 "𝙁𝙡𝙮: 𝙊𝙁𝙁"
𝙞𝙛 𝙣𝙤𝙩 𝙛𝙡𝙮𝙞𝙣𝙜 𝙩𝙝𝙚𝙣 𝙧𝙚𝙨𝙚𝙩𝙋𝙝𝙮𝙨𝙞𝙘𝙨(??𝙋.𝘾𝙝𝙖𝙧𝙖𝙘𝙩𝙚𝙧) 𝙚𝙣𝙙
𝙚𝙣𝙙)
 
𝙘𝘽𝙩𝙣2.𝙈𝙤𝙪𝙨𝙚𝘽𝙪𝙩𝙩𝙤𝙣1𝘾𝙡𝙞𝙘𝙠:𝘾𝙤𝙣𝙣𝙚𝙘𝙩(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣()
𝙣𝙤𝙘𝙡𝙞𝙥 = 𝙣𝙤𝙩 𝙣𝙤𝙘𝙡𝙞𝙥
𝙘𝘽𝙩𝙣2.𝙏𝙚𝙭𝙩 = 𝙣𝙤𝙘𝙡𝙞𝙥 𝙖𝙣𝙙 "𝙉𝙤𝙘𝙡𝙞𝙥: 𝙊𝙉" 𝙤𝙧 "𝙉𝙤𝙘𝙡𝙞𝙥: 𝙊𝙁𝙁"
𝙧𝙚𝙨𝙩𝙤𝙧𝙚𝙉𝙖𝙩𝙪𝙧𝙖𝙡𝘾𝙤𝙡𝙡𝙞𝙨𝙞𝙤𝙣(𝙇𝙋.𝘾𝙝𝙖𝙧𝙖𝙘𝙩𝙚𝙧)
𝙚𝙣𝙙)
 
𝙥𝙡𝙪𝙨𝘽𝙩𝙣2.𝙈𝙤𝙪𝙨𝙚𝘽𝙪𝙩𝙩𝙤𝙣1𝘾𝙡𝙞𝙘𝙠:𝘾𝙤𝙣𝙣𝙚𝙘𝙩(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣()
𝙛𝙡𝙮𝙎𝙥𝙚𝙚𝙙 = 𝙛𝙡𝙮𝙎𝙥𝙚𝙚𝙙 + 1
𝙨𝙉𝙪𝙢2.𝙏𝙚𝙭𝙩 = "𝙎𝙋𝘿: " .. 𝙩𝙤𝙨𝙩𝙧𝙞𝙣𝙜(𝙛𝙡𝙮𝙎𝙥𝙚𝙚𝙙)
𝙚𝙣𝙙)
 
𝙢𝙞𝙣𝙪𝙨𝘽𝙩𝙣2.𝙈𝙤𝙪𝙨𝙚𝘽𝙪𝙩𝙩𝙤𝙣1𝘾𝙡𝙞𝙘𝙠:𝘾𝙤𝙣𝙣𝙚𝙘𝙩(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣()
𝙛𝙡𝙮𝙎𝙥𝙚𝙚𝙙 = 𝙢𝙖𝙩𝙝.𝙢𝙖𝙭(1, 𝙛𝙡𝙮𝙎𝙥𝙚𝙚𝙙 - 1)
𝙨𝙉𝙪𝙢2.𝙏𝙚𝙭𝙩 = "𝙎𝙋𝘿: " .. 𝙩𝙤𝙨𝙩𝙧𝙞𝙣𝙜(𝙛𝙡𝙮𝙎𝙥𝙚𝙚𝙙)
𝙚𝙣𝙙)
 
𝙪𝙥𝘽𝙩𝙣2.𝙈𝙤𝙪𝙨𝙚𝘽𝙪𝙩𝙩𝙤𝙣1𝘿𝙤𝙬𝙣:𝘾𝙤𝙣𝙣𝙚𝙘𝙩(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣() 𝙫𝙑𝙚𝙘𝙩 = 1 𝙚𝙣𝙙)
𝙪𝙥𝘽𝙩𝙣2.𝙈𝙤𝙪𝙨𝙚𝘽𝙪𝙩𝙩𝙤𝙣1𝙐𝙥:𝘾𝙤𝙣𝙣𝙚𝙘𝙩(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣() 𝙫𝙑𝙚𝙘𝙩 = 0 𝙚𝙣𝙙)
𝙪𝙥𝘽𝙩𝙣2.𝙈𝙤𝙪𝙨𝙚𝙇𝙚𝙖𝙫𝙚:𝘾𝙤𝙣𝙣𝙚𝙘𝙩(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣() 𝙫𝙑𝙚𝙘𝙩 = 0 𝙚𝙣𝙙)
 
𝙙𝙣𝘽𝙩𝙣2.𝙈𝙤𝙪𝙨𝙚𝘽𝙪𝙩𝙩𝙤𝙣1𝘿𝙤𝙬𝙣:𝘾𝙤𝙣𝙣𝙚𝙘𝙩(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣() 𝙫𝙑𝙚𝙘𝙩 = -1 𝙚𝙣𝙙)
𝙙𝙣𝘽𝙩𝙣2.𝙈𝙤𝙪𝙨𝙚𝘽𝙪𝙩𝙩𝙤𝙣1𝙐𝙥:𝘾𝙤𝙣𝙣𝙚𝙘𝙩(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣() 𝙫𝙑𝙚𝙘𝙩 = 0 𝙚𝙣𝙙)
𝙙𝙣𝘽𝙩𝙣2.𝙈𝙤𝙪𝙨𝙚𝙇𝙚𝙖𝙫𝙚:𝘾𝙤𝙣𝙣𝙚𝙘𝙩(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣() 𝙫𝙑𝙚𝙘𝙩 = 0 𝙚𝙣𝙙)
 
𝙞𝙣𝙫𝘽𝙩𝙣2.𝙈𝙤𝙪𝙨𝙚𝘽𝙪𝙩𝙩𝙤𝙣1𝘾𝙡𝙞𝙘𝙠:𝘾𝙤𝙣𝙣𝙚𝙘𝙩(𝙏𝙤𝙜𝙜𝙡𝙚𝙄𝙣𝙫𝙞𝙨)
 
𝙗𝙍𝙚𝙡𝙤𝙖𝙙2.𝙈𝙤𝙪𝙨𝙚𝘽𝙪𝙩𝙩𝙤𝙣1𝘾𝙡𝙞𝙘𝙠:𝘾𝙤𝙣𝙣𝙚𝙘𝙩(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣()
𝙞𝙨𝙍𝙚𝙡𝙤𝙖𝙙𝙞𝙣𝙜 = 𝙣𝙤𝙩 𝙞𝙨𝙍𝙚𝙡𝙤𝙖𝙙𝙞𝙣𝙜
𝙡𝙤𝙘𝙖𝙡 𝙘𝙝𝙖𝙧 = 𝙇𝙋.𝘾𝙝𝙖𝙧𝙖𝙘𝙩𝙚𝙧
𝙡𝙤𝙘𝙖𝙡 𝙧𝙤𝙤𝙩 = 𝙘𝙝𝙖𝙧 𝙖𝙣𝙙 𝙘𝙝𝙖𝙧:𝙁𝙞𝙣𝙙𝙁𝙞𝙧𝙨𝙩𝘾𝙝𝙞𝙡𝙙("𝙃𝙪𝙢𝙖𝙣𝙤𝙞𝙙𝙍𝙤𝙤𝙩𝙋𝙖𝙧𝙩")
 
𝙡𝙤𝙘𝙖𝙡 𝙙𝙚𝙩𝙚𝙘𝙩𝙤𝙧𝙋𝙖𝙩𝙝
𝙡𝙤𝙘𝙖𝙡 𝙨𝙪𝙘𝙘𝙚𝙨𝙨 = 𝙥𝙘𝙖𝙡𝙡(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣()
𝙙𝙚𝙩𝙚𝙘𝙩𝙤𝙧𝙋𝙖𝙩𝙝 = 𝙬𝙤𝙧𝙠𝙨𝙥𝙖𝙘𝙚.𝙒𝙤𝙧𝙠𝙨𝙥𝙖𝙘𝙚𝘾𝙤𝙢["001_𝘾𝙧𝙞𝙢𝙞𝙣𝙖𝙡𝙒𝙚𝙖𝙥𝙤𝙣𝙨"].𝙂𝙞𝙫𝙚𝙏𝙤𝙤𝙡𝙨.𝘽𝙤𝙢𝙗.𝘾𝙡𝙞𝙘𝙠𝘿𝙚𝙩𝙚𝙘𝙩𝙤𝙧
𝙚𝙣𝙙)
 
𝙞𝙛 𝙞𝙨𝙍𝙚𝙡𝙤𝙖𝙙𝙞𝙣𝙜 𝙩𝙝𝙚𝙣
𝙗𝙍𝙚𝙡𝙤𝙖𝙙2.𝙏𝙚𝙭𝙩 = "𝙎𝙏𝙊𝙋 & 𝙏𝙋 𝘽𝘼𝘾𝙆"
𝙗𝙍𝙚𝙡𝙤𝙖𝙙2.𝘽𝙖𝙘𝙠𝙜𝙧𝙤𝙪𝙣𝙙𝘾𝙤𝙡𝙤𝙧3 = 𝘾𝙤𝙡𝙤𝙧3.𝙛𝙧𝙤𝙢𝙍𝙂𝘽(150, 0, 0)
𝙗𝙍𝙚𝙡𝙤𝙖𝙙2.𝙏𝙚𝙭𝙩𝘾𝙤𝙡𝙤𝙧3 = 𝘾𝙤𝙡𝙤𝙧3.𝙣𝙚𝙬(1, 1, 1)
𝙞𝙛 𝙧𝙤𝙤𝙩 𝙖𝙣𝙙 𝙨𝙪𝙘𝙘𝙚𝙨𝙨 𝙖𝙣𝙙 𝙙𝙚𝙩𝙚𝙘𝙩𝙤𝙧𝙋𝙖𝙩𝙝 𝙩𝙝𝙚𝙣
𝙤𝙧𝙞𝙜𝙞𝙣𝙖𝙡𝙋𝙤𝙨 = 𝙧𝙤𝙤𝙩.𝘾𝙁𝙧𝙖𝙢𝙚
𝙧𝙤𝙤𝙩.𝘾𝙁𝙧𝙖𝙢𝙚 = 𝙙𝙚𝙩𝙚𝙘𝙩𝙤𝙧𝙋𝙖𝙩𝙝.𝙋𝙖𝙧𝙚𝙣𝙩.𝘾𝙁𝙧𝙖𝙢𝙚
𝙚𝙣𝙙
𝙩𝙖𝙨𝙠.𝙨𝙥𝙖𝙬𝙣(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣()
𝙬𝙝𝙞𝙡𝙚 𝙞𝙨𝙍𝙚𝙡𝙤𝙖𝙙𝙞𝙣𝙜 𝙙𝙤
𝙥𝙘𝙖𝙡𝙡(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣()
𝙞𝙛 𝙙𝙚𝙩𝙚𝙘𝙩𝙤𝙧𝙋𝙖𝙩𝙝 𝙩𝙝𝙚𝙣
𝙛𝙞𝙧𝙚𝙘𝙡𝙞𝙘𝙠𝙙𝙚𝙩𝙚𝙘𝙩𝙤𝙧(𝙙𝙚𝙩𝙚𝙘𝙩𝙤𝙧𝙋𝙖𝙩𝙝)
𝙚𝙣𝙙
𝙚𝙣𝙙)
𝙩𝙖𝙨𝙠.𝙬𝙖𝙞𝙩(0.05)
𝙚𝙣𝙙
𝙚𝙣𝙙)
𝙚𝙡𝙨𝙚
𝙗𝙍𝙚𝙡𝙤𝙖𝙙2.𝙏𝙚𝙭𝙩 = "𝘼𝙐𝙏𝙊 𝙍𝙀𝙇𝙊𝘼𝘿 + 𝙏𝙋"
𝙗𝙍𝙚𝙡𝙤𝙖𝙙2.𝘽𝙖𝙘𝙠𝙜𝙧𝙤𝙪𝙣𝙙𝘾𝙤𝙡𝙤𝙧3 = 𝘾𝙊𝙇𝙊𝙍𝙎2.𝙑𝙤𝙞𝙙
𝙗𝙍𝙚𝙡𝙤𝙖𝙙2.𝙏𝙚𝙭𝙩𝘾𝙤𝙡𝙤𝙧3 = 𝘾𝙤𝙡𝙤𝙧3.𝙣𝙚𝙬(0.8, 0.8, 0.8)
𝙞𝙛 𝙧𝙤𝙤𝙩 𝙖𝙣𝙙 𝙤𝙧𝙞𝙜𝙞𝙣𝙖𝙡𝙋𝙤𝙨 𝙩𝙝𝙚𝙣
𝙧𝙤𝙤𝙩.𝘾𝙁𝙧𝙖𝙢𝙚 = 𝙤𝙧𝙞𝙜𝙞𝙣𝙖𝙡𝙋𝙤𝙨
𝙤𝙧𝙞𝙜𝙞𝙣𝙖𝙡𝙋𝙤𝙨 = 𝙣𝙞𝙡
𝙚𝙣𝙙
𝙚𝙣𝙙
𝙚𝙣𝙙)
 
𝙗𝙀𝙦𝙪𝙞𝙥2.𝙈𝙤𝙪𝙨𝙚𝘽𝙪𝙩𝙩𝙤𝙣1𝘾𝙡𝙞𝙘𝙠:𝘾𝙤𝙣𝙣𝙚𝙘𝙩(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣()
𝙡𝙤𝙘𝙖𝙡 𝙗𝙥 = 𝙇𝙋:𝙁𝙞𝙣𝙙𝙁𝙞𝙧𝙨𝙩𝘾𝙝𝙞𝙡𝙙("𝘽𝙖𝙘𝙠𝙥𝙖𝙘𝙠")
𝙞𝙛 𝙣𝙤𝙩 𝙗𝙥 𝙩𝙝𝙚𝙣 𝙧𝙚𝙩𝙪𝙧𝙣 𝙚𝙣𝙙
𝙛𝙤𝙧 _, 𝙫 𝙞𝙣 𝙥𝙖𝙞𝙧𝙨(𝙗𝙥:𝙂𝙚𝙩𝘾𝙝𝙞𝙡𝙙𝙧𝙚𝙣()) 𝙙𝙤
𝙞𝙛 𝙫.𝙉𝙖𝙢𝙚 == "𝘽𝙤𝙢𝙗" 𝙩𝙝𝙚𝙣
𝙥𝙘𝙖𝙡𝙡(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣() 𝙫.𝙋𝙖𝙧𝙚𝙣𝙩 = 𝙇𝙋.𝘾𝙝𝙖𝙧𝙖𝙘𝙩𝙚𝙧 𝙚𝙣𝙙)
𝙚𝙣𝙙
𝙚𝙣𝙙
𝙚𝙣𝙙)
 
𝙗𝘽𝙡𝙖𝙨𝙩2.𝙈𝙤𝙪𝙨𝙚𝘽𝙪𝙩𝙩𝙤𝙣1𝘾𝙡𝙞𝙘𝙠:𝘾𝙤𝙣𝙣𝙚𝙘𝙩(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣()
𝙡𝙤𝙘𝙖𝙡 𝙘𝙝𝙖𝙧 = 𝙇𝙋.𝘾𝙝𝙖𝙧𝙖𝙘𝙩𝙚𝙧
𝙞𝙛 𝙣𝙤𝙩 𝙘𝙝𝙖𝙧 𝙩𝙝𝙚𝙣 𝙧𝙚𝙩𝙪𝙧𝙣 𝙚𝙣𝙙
 
𝙡𝙤𝙘𝙖𝙡 𝙗𝙤𝙢𝙗𝙨 = {}
𝙡𝙤𝙘𝙖𝙡 𝙗𝙥 = 𝙇𝙋:𝙁𝙞𝙣𝙙𝙁𝙞𝙧𝙨𝙩𝘾𝙝𝙞𝙡𝙙("𝘽𝙖𝙘𝙠𝙥𝙖𝙘𝙠")
𝙞𝙛 𝙗𝙥 𝙩𝙝𝙚𝙣
𝙛𝙤𝙧 _, 𝙫 𝙞𝙣 𝙥𝙖𝙞𝙧𝙨(𝙗𝙥:𝙂𝙚𝙩𝘾𝙝𝙞𝙡𝙙𝙧𝙚𝙣()) 𝙙𝙤
𝙞𝙛 𝙫.𝙉𝙖𝙢𝙚 == "𝘽𝙤𝙢𝙗" 𝙩𝙝𝙚𝙣 𝙩𝙖𝙗𝙡𝙚.𝙞𝙣𝙨𝙚𝙧𝙩(𝙗𝙤𝙢𝙗𝙨, 𝙫) 𝙚𝙣𝙙
𝙚𝙣𝙙
𝙚𝙣𝙙
𝙛𝙤𝙧 _, 𝙫 𝙞𝙣 𝙥𝙖𝙞𝙧𝙨(𝙘𝙝𝙖𝙧:𝙂𝙚𝙩𝘾𝙝𝙞𝙡𝙙𝙧𝙚𝙣()) 𝙙𝙤
𝙞𝙛 𝙫.𝙉𝙖𝙢𝙚 == "𝘽𝙤𝙢𝙗" 𝙩𝙝𝙚𝙣 𝙩𝙖𝙗𝙡𝙚.𝙞𝙣𝙨𝙚𝙧𝙩(𝙗𝙤𝙢𝙗𝙨, 𝙫) 𝙚𝙣𝙙
𝙚𝙣𝙙
 
𝙞𝙛 #𝙗𝙤𝙢𝙗𝙨 == 0 𝙩𝙝𝙚𝙣 𝙧𝙚𝙩𝙪𝙧𝙣 𝙚𝙣𝙙
 
𝙛𝙤𝙧 𝙞, 𝙗𝙤𝙢𝙗 𝙞𝙣 𝙞𝙥𝙖𝙞𝙧𝙨(𝙗𝙤𝙢𝙗𝙨) 𝙙𝙤
𝙩𝙖𝙨𝙠.𝙨𝙥𝙖𝙬𝙣(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣()
𝙥𝙘𝙖𝙡𝙡(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣()
𝙗𝙤𝙢𝙗.𝙋𝙖𝙧𝙚𝙣𝙩 = 𝙘𝙝𝙖𝙧
𝙩𝙖𝙨𝙠.𝙬𝙖𝙞𝙩()
𝙗𝙤𝙢𝙗:𝘼𝙘𝙩𝙞𝙫𝙖𝙩𝙚()
𝙚𝙣𝙙)
𝙚𝙣𝙙)
𝙞𝙛 𝙞 % 20 == 0 𝙩𝙝𝙚𝙣 𝙍𝙪𝙣𝙎𝙚𝙧𝙫𝙞𝙘𝙚.𝙃𝙚𝙖𝙧𝙩𝙗𝙚𝙖𝙩:𝙒𝙖𝙞𝙩() 𝙚𝙣𝙙
𝙚𝙣𝙙
𝙚𝙣𝙙)
 
𝙗𝘿𝙚𝙩𝙤𝙣𝙖𝙩𝙚2.𝙈𝙤𝙪𝙨𝙚𝘽𝙪𝙩𝙩𝙤𝙣1𝘾𝙡𝙞𝙘𝙠:𝘾𝙤𝙣𝙣𝙚𝙘𝙩(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣()
𝙡𝙤𝙘𝙖𝙡 𝙖𝙧𝙜𝙨 = { "𝘽𝙤𝙢𝙗" .. 𝙇𝙋.𝙉𝙖𝙢𝙚 }
𝙥𝙘𝙖𝙡𝙡(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣()
𝙡𝙤𝙘𝙖𝙡 𝙧𝙚 = 𝙍𝙚𝙥𝙡𝙞𝙘𝙖𝙩𝙚𝙙𝙎𝙩𝙤𝙧𝙖𝙜𝙚:𝙁𝙞𝙣𝙙𝙁𝙞𝙧𝙨𝙩𝘾𝙝𝙞𝙡𝙙("𝙍𝙀")
𝙞𝙛 𝙧𝙚 𝙩𝙝𝙚𝙣
𝙡𝙤𝙘𝙖𝙡 𝙗𝙡𝙤𝙬𝘽𝙤𝙢𝙗𝙨 = 𝙧𝙚:𝙁𝙞𝙣𝙙𝙁𝙞𝙧𝙨𝙩𝘾𝙝𝙞𝙡𝙙("1𝘽𝙡𝙤1𝙬𝘽𝙤𝙢𝙗1𝙨𝙎𝙚𝙧𝙫𝙚1𝙧")
𝙞𝙛 𝙗𝙡𝙤𝙬𝘽𝙤𝙢𝙗𝙨 𝙩𝙝𝙚𝙣
𝙗𝙡𝙤𝙬𝘽𝙤𝙢𝙗𝙨:𝙁𝙞𝙧𝙚𝙎𝙚𝙧𝙫𝙚𝙧(𝙪𝙣𝙥𝙖𝙘𝙠(𝙖𝙧𝙜𝙨))
𝙚𝙣𝙙
𝙚𝙣𝙙
𝙚𝙣𝙙)
𝙚𝙣𝙙)
 
𝙈𝙞𝙣𝘽𝙩𝙣2.𝙈𝙤𝙪𝙨𝙚𝘽𝙪𝙩𝙩𝙤𝙣1𝘾𝙡𝙞𝙘𝙠:𝘾𝙤𝙣𝙣𝙚𝙘𝙩(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣()
𝙞𝙨𝙈𝙞𝙣𝙞𝙢𝙞𝙯𝙚𝙙 = 𝙣𝙤𝙩 𝙞𝙨𝙈𝙞𝙣𝙞𝙢𝙞𝙯𝙚𝙙
𝙡𝙤𝙘𝙖𝙡 𝙩𝙖𝙧𝙜𝙚𝙩𝙎𝙞𝙯𝙚 = 𝙞𝙨𝙈𝙞𝙣𝙞𝙢𝙞𝙯𝙚𝙙 𝙖𝙣𝙙 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(0, 200, 0, 30) 𝙤𝙧 𝙐𝘿𝙞𝙢2.𝙣𝙚𝙬(0, 200, 0, 455)
𝙈𝙞𝙣𝘽𝙩𝙣2.𝙏𝙚𝙭𝙩 = 𝙞𝙨𝙈𝙞𝙣𝙞𝙢𝙞𝙯𝙚𝙙 𝙖𝙣𝙙 "▼" 𝙤𝙧 "▲"
𝙡𝙤𝙘𝙖𝙡 𝙩𝙬𝙚𝙚𝙣𝙄𝙣𝙛𝙤 = 𝙏𝙬𝙚𝙚𝙣𝙄𝙣𝙛𝙤.𝙣𝙚𝙬(0.4, 𝙀𝙣𝙪𝙢.𝙀𝙖𝙨𝙞𝙣𝙜𝙎𝙩𝙮𝙡𝙚.𝙌𝙪𝙖𝙧𝙩, 𝙀𝙣𝙪𝙢.𝙀𝙖𝙨𝙞𝙣𝙜𝘿𝙞𝙧𝙚𝙘𝙩𝙞𝙤𝙣.𝙊𝙪𝙩)
𝙏𝙬𝙚𝙚𝙣𝙎𝙚𝙧𝙫𝙞𝙘𝙚:𝘾𝙧𝙚𝙖𝙩𝙚(𝙢𝙖𝙞𝙣2, 𝙩𝙬𝙚𝙚𝙣𝙄𝙣𝙛𝙤, {𝙎𝙞𝙯𝙚 = 𝙩𝙖𝙧𝙜𝙚𝙩𝙎𝙞𝙯𝙚}):𝙋𝙡𝙖𝙮()
𝙘𝙤𝙣𝙩𝙚𝙣𝙩𝘾𝙤𝙣𝙩𝙖𝙞𝙣𝙚𝙧2.𝙑𝙞𝙨𝙞𝙗𝙡𝙚 = 𝙣𝙤𝙩 𝙞𝙨𝙈𝙞𝙣𝙞𝙢𝙞𝙯𝙚𝙙
𝙚𝙣𝙙)
 
𝙩𝙖𝙨𝙠.𝙨𝙥𝙖𝙬𝙣(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣()
𝙬𝙝𝙞𝙡𝙚 𝙩𝙧𝙪𝙚 𝙙𝙤
𝙥𝙘𝙖𝙡𝙡(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣()
𝘾𝙤𝙪𝙣𝙩𝙚𝙧2.𝙏𝙚𝙭𝙩 = "𝘽𝙊𝙈𝘽𝙎 𝘾𝙊𝙐𝙉𝙏𝙀𝙍: " .. 𝙜𝙚𝙩𝘽𝙤𝙢𝙗𝘾𝙤𝙪𝙣𝙩()
𝙚𝙣𝙙)
𝙩𝙖𝙨𝙠.𝙬𝙖𝙞𝙩(0.4)
𝙚𝙣𝙙
𝙚𝙣𝙙)
 
𝙡𝙤𝙘𝙖𝙡 𝘾𝙤𝙣𝙣𝙚𝙘𝙩𝙞𝙤𝙣𝙨 = {}
 
𝘾𝙤𝙣𝙣𝙚𝙘𝙩𝙞𝙤𝙣𝙨[1] = 𝙍𝙪𝙣𝙎𝙚𝙧𝙫𝙞𝙘𝙚.𝙃𝙚𝙖𝙧𝙩𝙗𝙚𝙖𝙩:𝘾𝙤𝙣𝙣𝙚𝙘𝙩(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣()
𝙡𝙤𝙘𝙖𝙡 𝙘𝙝𝙖𝙧 = 𝙇𝙋.𝘾𝙝𝙖𝙧𝙖𝙘𝙩𝙚𝙧
𝙡𝙤𝙘𝙖𝙡 𝙧𝙤𝙤𝙩 = 𝙘𝙝𝙖𝙧 𝙖𝙣𝙙 𝙘𝙝𝙖𝙧:𝙁𝙞𝙣𝙙𝙁𝙞𝙧𝙨𝙩𝘾𝙝𝙞𝙡𝙙("𝙃𝙪𝙢𝙖𝙣𝙤𝙞𝙙𝙍𝙤𝙤𝙩𝙋𝙖𝙧𝙩")
𝙡𝙤𝙘𝙖𝙡 𝙝𝙪𝙢 = 𝙘𝙝𝙖𝙧 𝙖𝙣𝙙 𝙘𝙝𝙖𝙧:𝙁𝙞𝙣𝙙𝙁𝙞𝙧𝙨𝙩𝘾𝙝𝙞𝙡𝙙("𝙃𝙪𝙢𝙖𝙣𝙤𝙞𝙙")
 
𝙞𝙛 𝙄𝙨𝙄𝙣𝙫𝙞𝙨𝙞𝙗𝙡𝙚 𝙖𝙣𝙙 𝙧𝙤𝙤𝙩 𝙖𝙣𝙙 𝙝𝙪𝙢 𝙩𝙝𝙚𝙣
𝙡𝙤𝙘𝙖𝙡 𝙊𝙧𝙞𝙜𝙞𝙣𝙖𝙡𝘾𝙁𝙧𝙖𝙢𝙚 = 𝙧𝙤𝙤𝙩.𝘾𝙁𝙧𝙖𝙢𝙚
𝙡𝙤𝙘𝙖𝙡 𝙊𝙧𝙞𝙜𝙞𝙣𝙖𝙡𝘾𝙖𝙢𝙚𝙧𝙖𝙊𝙛𝙛𝙨𝙚𝙩 = 𝙝𝙪𝙢.𝘾𝙖𝙢𝙚𝙧𝙖𝙊𝙛𝙛𝙨𝙚𝙩
 
𝙑𝙞𝙧𝙩𝙪𝙖𝙡𝙍𝙤𝙤𝙩𝘾𝙁𝙧𝙖𝙢𝙚 = 𝙊𝙧𝙞𝙜𝙞𝙣𝙖𝙡𝘾𝙁𝙧𝙖𝙢𝙚
 
𝙡𝙤𝙘𝙖𝙡 𝘿𝙤𝙬𝙣𝘾𝙁𝙧𝙖𝙢𝙚 = 𝙊𝙧𝙞𝙜𝙞𝙣𝙖𝙡𝘾𝙁𝙧𝙖𝙢𝙚 * 𝘾𝙁𝙧𝙖𝙢𝙚.𝙣𝙚𝙬(0, -500000, 0)
𝙧𝙤𝙤𝙩.𝘾𝙁𝙧𝙖𝙢𝙚 = 𝘿𝙤𝙬𝙣𝘾𝙁𝙧𝙖𝙢𝙚
𝙝𝙪𝙢.𝘾𝙖𝙢𝙚𝙧𝙖𝙊𝙛𝙛𝙨𝙚𝙩 = 𝘿𝙤𝙬𝙣𝘾𝙁𝙧𝙖𝙢𝙚:𝙏𝙤𝙊𝙗𝙟𝙚𝙘𝙩𝙎𝙥𝙖𝙘𝙚(𝘾𝙁𝙧𝙖𝙢𝙚.𝙣𝙚𝙬(𝙊𝙧𝙞𝙜𝙞𝙣𝙖𝙡𝘾𝙁𝙧𝙖𝙢𝙚.𝙋𝙤𝙨𝙞𝙩𝙞𝙤𝙣)).𝙋𝙤𝙨𝙞𝙩𝙞𝙤𝙣
 
𝙍𝙪𝙣𝙎𝙚𝙧𝙫𝙞𝙘𝙚.𝙍𝙚𝙣𝙙𝙚𝙧𝙎𝙩𝙚𝙥𝙥𝙚𝙙:𝙒𝙖𝙞𝙩()
 
𝙧𝙤𝙤𝙩.𝘾𝙁𝙧𝙖𝙢𝙚 = 𝙊𝙧𝙞𝙜𝙞𝙣𝙖𝙡𝘾𝙁𝙧𝙖𝙢𝙚
𝙝𝙪𝙢.𝘾𝙖𝙢𝙚𝙧𝙖𝙊𝙛𝙛𝙨𝙚𝙩 = 𝙊𝙧𝙞𝙜𝙞𝙣𝙖𝙡𝘾𝙖𝙢𝙚𝙧𝙖𝙊𝙛𝙛𝙨𝙚𝙩
𝙚𝙡𝙨𝙚𝙞𝙛 𝙧𝙤𝙤𝙩 𝙖𝙣𝙙 𝙣𝙤𝙩 𝙄𝙨𝙏𝙧𝙖𝙣𝙨𝙞𝙩𝙞𝙤𝙣𝙞𝙣𝙜 𝙩𝙝𝙚𝙣
𝙑𝙞𝙧𝙩𝙪𝙖𝙡𝙍𝙤𝙤𝙩𝘾𝙁𝙧𝙖𝙢𝙚 = 𝙧𝙤𝙤𝙩.𝘾𝙁𝙧𝙖𝙢𝙚
𝙚𝙣𝙙
𝙚𝙣𝙙)
 
𝘾𝙤𝙣𝙣𝙚𝙘𝙩𝙞𝙤𝙣𝙨[2] = 𝙍𝙪𝙣𝙎𝙚𝙧𝙫𝙞𝙘𝙚.𝙃𝙚𝙖𝙧𝙩𝙗𝙚𝙖𝙩:𝘾𝙤𝙣𝙣𝙚𝙘𝙩(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣(𝙙𝙩)
𝙡𝙤𝙘𝙖𝙡 𝙩𝙤𝙩𝙖𝙡𝙋𝙧𝙤𝙥𝙨 = #𝙬𝙞𝙣𝙜𝙍𝙚𝙢𝙤𝙩𝙚𝘾𝙖𝙘𝙝𝙚2
𝙞𝙛 𝙣𝙤𝙩 𝙥𝙚𝙩𝙈𝙤𝙙𝙚2 𝙤𝙧 𝙩𝙤𝙩𝙖𝙡𝙋𝙧𝙤𝙥𝙨 < 1 𝙩𝙝𝙚𝙣 𝙧𝙚𝙩𝙪𝙧𝙣 𝙚𝙣𝙙
 
𝙡𝙤𝙘𝙖𝙡 𝙩 = 𝙩𝙞𝙘𝙠()
𝙡𝙤𝙘𝙖𝙡 𝙘𝙪𝙧𝙧𝙚𝙣𝙩𝙋𝙤𝙨 = 𝙑𝙞𝙧𝙩𝙪𝙖𝙡𝙍𝙤𝙤𝙩𝘾𝙁𝙧𝙖𝙢𝙚.𝙋𝙤𝙨𝙞𝙩𝙞𝙤𝙣
𝙡𝙤𝙘𝙖𝙡 𝙘𝙖𝙡𝙘𝙪𝙡𝙖𝙩𝙚𝙙𝙑𝙚𝙡𝙤𝙘𝙞𝙩𝙮 = (𝙘𝙪𝙧𝙧𝙚𝙣𝙩𝙋𝙤𝙨 - 𝙡𝙖𝙨𝙩𝙋𝙤𝙨𝙞𝙩𝙞𝙤𝙣) / 𝙢𝙖𝙩𝙝.𝙢𝙖𝙭(𝙙𝙩, 0.001)
𝙡𝙖𝙨𝙩𝙋𝙤𝙨𝙞𝙩𝙞𝙤𝙣 = 𝙘𝙪𝙧𝙧𝙚𝙣𝙩𝙋𝙤𝙨
 
𝙡𝙤𝙘𝙖𝙡 𝙡𝙖𝙜𝘾𝙤𝙢𝙥 = 𝙛𝙡𝙮𝙞𝙣𝙜 𝙖𝙣𝙙 𝙢𝙖𝙩𝙝.𝙘𝙡𝙖𝙢𝙥(𝙛𝙡𝙮𝙎𝙥𝙚𝙚𝙙 * 0.25, 0, 50) 𝙤𝙧 0
𝙡𝙤𝙘𝙖𝙡 𝙨𝙖𝙛𝙚𝙋𝙞𝙣𝙜 = 𝙢𝙖𝙩𝙝.𝙘𝙡𝙖𝙢𝙥(𝙚𝙨𝙩𝙞𝙢𝙖𝙩𝙚𝙙𝙋𝙞𝙣𝙜, 0.01, 0.25)
 
𝙡𝙤𝙘𝙖𝙡 𝙥𝙧𝙚𝙙𝙞𝙘𝙩𝙚𝙙𝙋𝙤𝙨𝙞𝙩𝙞𝙤𝙣 = 𝙘𝙪𝙧𝙧𝙚𝙣𝙩𝙋𝙤𝙨 + (𝙘𝙖𝙡𝙘𝙪𝙡𝙖𝙩𝙚𝙙𝙑𝙚𝙡𝙤𝙘𝙞𝙩𝙮 * 𝙨𝙖𝙛𝙚𝙋𝙞𝙣𝙜)
𝙡𝙤𝙘𝙖𝙡 𝙗𝙖𝙨𝙚𝙏𝙖𝙧𝙜𝙚𝙩𝘾𝙁 = 𝘾𝙁𝙧𝙖𝙢𝙚.𝙣𝙚𝙬(𝙥𝙧𝙚𝙙𝙞𝙘𝙩𝙚𝙙𝙋𝙤𝙨𝙞𝙩𝙞𝙤𝙣, 𝙥𝙧𝙚𝙙𝙞𝙘𝙩𝙚𝙙𝙋𝙤𝙨𝙞𝙩𝙞𝙤𝙣 + 𝙑𝙞𝙧𝙩𝙪𝙖𝙡𝙍𝙤𝙤𝙩𝘾𝙁𝙧𝙖𝙢𝙚.𝙇𝙤𝙤𝙠𝙑𝙚𝙘𝙩𝙤𝙧)
 
𝙡𝙤𝙘𝙖𝙡 𝙛𝙞𝙣𝙖𝙡𝙋𝙤𝙨 = 𝙗𝙖𝙨𝙚𝙏𝙖𝙧𝙜𝙚𝙩𝘾𝙁 * 𝘾𝙁𝙧𝙖𝙢𝙚.𝙣𝙚𝙬(0, 𝙛𝙡𝙮𝙞𝙣𝙜 𝙖𝙣𝙙 -4 𝙤𝙧 0, (𝙛𝙡𝙮𝙞𝙣𝙜 𝙖𝙣𝙙 -18 𝙤𝙧 0) - 𝙡𝙖𝙜𝘾𝙤𝙢𝙥)
𝙡𝙤𝙘𝙖𝙡 𝙧𝙤𝙩𝘾𝙁 = 𝘾𝙁𝙧𝙖𝙢𝙚.𝘼𝙣𝙜𝙡𝙚𝙨(𝙢𝙖𝙩𝙝.𝙧𝙖𝙙(𝙈𝘼𝙉𝙐𝘼𝙇_𝙍𝙊𝙏𝘼𝙏𝙄𝙊𝙉.𝙓), 𝙢𝙖𝙩𝙝.𝙧𝙖𝙙(𝙈𝘼𝙉𝙐𝘼𝙇_𝙍𝙊𝙏𝘼𝙏𝙄𝙊𝙉.𝙔), 𝙢𝙖𝙩𝙝.𝙧𝙖𝙙(𝙈𝘼𝙉𝙐𝘼𝙇_𝙍𝙊𝙏𝘼𝙏𝙄𝙊𝙉.𝙕))
𝙡𝙤𝙘𝙖𝙡 𝙧𝙤𝙡𝙡𝙈𝙖𝙣𝙚𝙪𝙫𝙚𝙧𝘾𝙁 = 𝘾𝙁𝙧𝙖𝙢𝙚.𝘼𝙣𝙜𝙡𝙚𝙨(𝙢𝙖𝙩𝙝.𝙧𝙖𝙙(𝙘𝙪𝙧𝙧𝙚𝙣𝙩𝙍𝙤𝙡𝙡), 0, 0)
 
𝙡𝙤𝙘𝙖𝙡 𝙡𝙚𝙧𝙥𝘼𝙡𝙥𝙝𝙖 = 1 - 𝙢𝙖𝙩𝙝.𝙚𝙭𝙥(-14 * 𝙙𝙩)
 
𝙛𝙤𝙧 𝙞, 𝙤𝙛𝙛𝙨𝙚𝙩 𝙞𝙣 𝙞𝙥𝙖𝙞𝙧𝙨(𝘽2𝙎𝙥𝙞𝙧𝙞𝙩𝙋𝙖𝙧𝙩𝙨) 𝙙𝙤
𝙞𝙛 𝙞 <= 𝙩𝙤𝙩𝙖𝙡𝙋𝙧𝙤𝙥𝙨 𝙩𝙝𝙚𝙣
𝙡𝙤𝙘𝙖𝙡 𝙩𝙖𝙧𝙜𝙚𝙩𝘾𝙁 = 𝙛𝙞𝙣𝙖𝙡𝙋𝙤𝙨 * 𝙧𝙤𝙩𝘾𝙁 * 𝙧𝙤𝙡𝙡𝙈𝙖𝙣𝙚𝙪𝙫𝙚𝙧𝘾𝙁 * 𝙤𝙛𝙛𝙨𝙚𝙩
𝙘𝙪𝙧𝙧𝙚𝙣𝙩𝘾𝙁𝙧𝙖𝙢𝙚𝙨[𝙞] = (𝙘𝙪𝙧𝙧𝙚𝙣𝙩𝘾𝙁𝙧𝙖𝙢𝙚𝙨[𝙞] 𝙤𝙧 𝙩𝙖𝙧𝙜𝙚𝙩𝘾𝙁):𝙇𝙚𝙧𝙥(𝙩𝙖𝙧𝙜𝙚𝙩𝘾𝙁, 𝙡𝙚𝙧𝙥𝘼𝙡𝙥𝙝𝙖)
𝙚𝙣𝙙
𝙚𝙣𝙙
 
𝙞𝙛 𝙩 - 𝙡𝙖𝙨𝙩𝙉𝙚𝙩𝙬𝙤𝙧𝙠𝙐𝙥𝙙𝙖𝙩𝙚 > 0.014 𝙩𝙝𝙚𝙣
𝙡𝙤𝙘𝙖𝙡 𝙘𝙖𝙣𝙐𝙥𝙙𝙖𝙩𝙚𝘾𝙤𝙡𝙤𝙧 = (𝙩 - 𝙡𝙖𝙨𝙩𝘾𝙤𝙡𝙤𝙧𝙐𝙥𝙙𝙖𝙩𝙚 > 0.05)
𝙡𝙤𝙘𝙖𝙡 𝙛𝙧𝙖𝙢𝙚𝘾𝙁𝙧𝙖𝙢𝙚𝙨 = 𝙘𝙪𝙧𝙧𝙚𝙣𝙩𝘾𝙁𝙧𝙖𝙢𝙚𝙨
 
𝙛𝙤𝙧 𝙞 = 1, 𝙩𝙤𝙩𝙖𝙡𝙋𝙧𝙤𝙥𝙨 𝙙𝙤
𝙡𝙤𝙘𝙖𝙡 𝙥𝙧𝙤𝙥 = 𝙬𝙞𝙣𝙜𝙍𝙚𝙢𝙤𝙩𝙚𝘾𝙖𝙘𝙝𝙚2[𝙞]
𝙡𝙤𝙘𝙖𝙡 𝙩𝙖𝙧𝙜𝙚𝙩𝘾𝙁𝙧𝙖𝙢𝙚 = 𝙛𝙧𝙖𝙢𝙚𝘾𝙁𝙧𝙖𝙢𝙚𝙨[𝙞]
 
𝙞𝙛 𝙥𝙧𝙤𝙥 𝙖𝙣𝙙 𝙩𝙖𝙧𝙜𝙚𝙩𝘾𝙁𝙧𝙖𝙢𝙚 𝙩𝙝𝙚𝙣
𝙩𝙖𝙨𝙠.𝙨𝙥𝙖𝙬𝙣(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣()
𝙡𝙤𝙘𝙖𝙡 𝙘𝙛𝙍 = 𝙥𝙧𝙤𝙥:𝙁𝙞𝙣𝙙𝙁𝙞𝙧𝙨𝙩𝘾𝙝𝙞𝙡𝙙("𝙎𝙚𝙩𝘾𝙪𝙧𝙧𝙚𝙣𝙩𝘾𝙁𝙧𝙖𝙢𝙚")
𝙞𝙛 𝙘𝙛𝙍 𝙩𝙝𝙚𝙣
𝙡𝙤𝙘𝙖𝙡 𝙨𝙩𝙖𝙧𝙩𝙎𝙚𝙣𝙙 = 𝙤𝙨.𝙘𝙡𝙤𝙘𝙠()
𝙥𝙘𝙖𝙡𝙡(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣()
𝙘𝙛𝙍:𝙄𝙣𝙫𝙤𝙠𝙚𝙎𝙚𝙧𝙫𝙚𝙧(𝙩𝙖𝙧𝙜𝙚𝙩𝘾𝙁𝙧𝙖𝙢𝙚)
𝙞𝙛 𝙞 == 1 𝙩𝙝𝙚𝙣
𝙚𝙨𝙩𝙞𝙢𝙖𝙩𝙚𝙙𝙋𝙞𝙣𝙜 = (𝙚𝙨𝙩𝙞𝙢𝙖𝙩𝙚𝙙𝙋𝙞𝙣𝙜 * 0.85) + ((𝙤𝙨.𝙘𝙡𝙤𝙘𝙠() - 𝙨𝙩𝙖𝙧𝙩𝙎𝙚𝙣𝙙) * 0.15)
𝙚𝙣𝙙
𝙚𝙣𝙙)
𝙚𝙣𝙙
 
𝙞𝙛 𝙘𝙖𝙣𝙐𝙥𝙙𝙖𝙩𝙚𝘾𝙤𝙡𝙤𝙧 𝙖𝙣𝙙 𝙞 == 𝙘𝙤𝙡𝙤𝙧𝙄𝙣𝙙𝙚𝙭2 𝙩𝙝𝙚𝙣
𝙡𝙤𝙘𝙖𝙡 𝙘𝙧𝙍 = 𝙥𝙧𝙤𝙥:𝙁𝙞𝙣𝙙𝙁𝙞𝙧𝙨𝙩𝘾𝙝𝙞𝙡𝙙("𝘾𝙝𝙖𝙣𝙜𝙚𝙋𝙧𝙤𝙥𝘾𝙤𝙡𝙤𝙧")
𝙞𝙛 𝙘𝙧𝙍 𝙩𝙝𝙚𝙣
𝙥𝙘𝙖𝙡𝙡(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣() 𝙘𝙧𝙍:𝙄𝙣𝙫𝙤𝙠𝙚𝙎𝙚𝙧𝙫𝙚𝙧(𝙜𝙚𝙩𝘼𝙗𝙮𝙨𝙨𝘾𝙤𝙡𝙤𝙧2(𝙩, 𝙞)) 𝙚𝙣𝙙)
𝙚𝙣𝙙
𝙚𝙣𝙙
𝙚𝙣𝙙)
𝙚𝙣𝙙
𝙚𝙣𝙙
 
𝙞𝙛 𝙘𝙖𝙣𝙐𝙥𝙙𝙖𝙩𝙚𝘾𝙤𝙡𝙤𝙧 𝙩𝙝𝙚𝙣
𝙘𝙤𝙡𝙤𝙧𝙄𝙣𝙙𝙚𝙭2 = (𝙘𝙤𝙡𝙤𝙧𝙄𝙣𝙙𝙚𝙭2 % 𝙩𝙤𝙩𝙖𝙡𝙋𝙧𝙤𝙥𝙨) + 1
𝙡𝙖𝙨𝙩𝘾𝙤𝙡𝙤𝙧𝙐𝙥𝙙𝙖𝙩𝙚 = 𝙩
𝙚𝙣𝙙
𝙡𝙖𝙨𝙩𝙉𝙚𝙩𝙬𝙤𝙧𝙠𝙐𝙥𝙙𝙖𝙩𝙚 = 𝙩
𝙚𝙣𝙙
𝙚𝙣𝙙)
 
𝘾𝙤𝙣𝙣𝙚𝙘𝙩𝙞𝙤𝙣𝙨[3] = 𝙍𝙪𝙣𝙎𝙚𝙧𝙫𝙞𝙘𝙚.𝙍𝙚𝙣𝙙𝙚𝙧𝙎𝙩𝙚𝙥𝙥𝙚𝙙:𝘾𝙤𝙣𝙣𝙚𝙘𝙩(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣(𝙙𝙩)
𝙡𝙤𝙘𝙖𝙡 𝙘𝙝𝙖𝙧 = 𝙇𝙋.𝘾𝙝𝙖𝙧𝙖𝙘𝙩𝙚𝙧
𝙞𝙛 𝙛𝙡𝙮𝙞𝙣𝙜 𝙖𝙣𝙙 𝙘𝙝𝙖𝙧 𝙖𝙣𝙙 𝙘𝙝𝙖𝙧:𝙁𝙞𝙣𝙙𝙁𝙞𝙧𝙨𝙩𝘾𝙝𝙞𝙡𝙙("𝙃𝙪𝙢𝙖𝙣𝙤𝙞𝙙𝙍𝙤𝙤𝙩𝙋𝙖𝙧𝙩") 𝙩𝙝𝙚𝙣
𝙡𝙤𝙘𝙖𝙡 𝙧𝙤𝙤𝙩 = 𝙘𝙝𝙖𝙧.𝙃𝙪𝙢𝙖𝙣𝙤𝙞𝙙𝙍𝙤𝙤𝙩𝙋𝙖𝙧𝙩
𝙡𝙤𝙘𝙖𝙡 𝙝𝙪𝙢 = 𝙘𝙝𝙖𝙧:𝙁𝙞𝙣𝙙𝙁𝙞𝙧𝙨𝙩𝘾𝙝𝙞𝙡𝙙("𝙃𝙪𝙢𝙖𝙣𝙤𝙞𝙙")
𝙡𝙤𝙘𝙖𝙡 𝙘𝙖𝙢 = 𝙬𝙤𝙧𝙠𝙨𝙥𝙖𝙘𝙚.𝘾𝙪𝙧𝙧𝙚𝙣𝙩𝘾𝙖𝙢𝙚𝙧𝙖
𝙞𝙛 𝙣𝙤𝙩 𝙝𝙪𝙢 𝙤𝙧 𝙣𝙤𝙩 𝙘𝙖𝙢 𝙩𝙝𝙚𝙣 𝙧𝙚𝙩𝙪𝙧𝙣 𝙚𝙣𝙙
 
𝙡𝙤𝙘𝙖𝙡 𝙗𝙫 = 𝙧𝙤𝙤𝙩:𝙁𝙞𝙣𝙙𝙁𝙞𝙧𝙨𝙩𝘾𝙝𝙞𝙡𝙙("𝘾𝙤𝙙𝙚𝙑𝙚𝙡") 𝙤𝙧 𝙄𝙣𝙨𝙩𝙖𝙣𝙘𝙚.𝙣𝙚𝙬("𝘽𝙤𝙙𝙮𝙑𝙚𝙡𝙤𝙘𝙞𝙩𝙮")
𝙡𝙤𝙘𝙖𝙡 𝙗𝙜 = 𝙧𝙤𝙤𝙩:𝙁𝙞𝙣𝙙𝙁𝙞𝙧𝙨𝙩𝘾𝙝𝙞𝙡𝙙("𝘾𝙤𝙙𝙚𝙂𝙮𝙧𝙤") 𝙤𝙧 𝙄𝙣𝙨𝙩𝙖𝙣𝙘𝙚.𝙣𝙚𝙬("𝘽𝙤𝙙𝙮𝙂𝙮𝙧𝙤")
𝙗𝙫.𝙉𝙖𝙢𝙚 = "𝘾𝙤𝙙𝙚𝙑𝙚𝙡"
𝙗𝙜.𝙉𝙖𝙢𝙚 = "𝘾𝙤𝙙𝙚𝙂𝙮𝙧𝙤"
𝙗𝙫.𝙋𝙖𝙧𝙚𝙣𝙩 = 𝙧𝙤𝙤𝙩
𝙗𝙜.𝙋𝙖𝙧𝙚𝙣𝙩 = 𝙧𝙤𝙤𝙩
𝙗𝙫.𝙈𝙖𝙭𝙁𝙤𝙧𝙘𝙚 = 𝙑𝙚𝙘𝙩𝙤𝙧3.𝙣𝙚𝙬(1𝙚8, 1𝙚8, 1𝙚8)
𝙗𝙜.𝙈𝙖𝙭𝙏𝙤𝙧𝙦𝙪𝙚 = 𝙑𝙚𝙘𝙩𝙤𝙧3.𝙣𝙚𝙬(1𝙚8, 1𝙚8, 1𝙚8)
𝙗𝙜.𝙋 = 48000
𝙗𝙜.𝘿 = 520
𝙝𝙪𝙢.𝙋𝙡𝙖𝙩𝙛𝙤𝙧𝙢𝙎𝙩𝙖𝙣𝙙 = 𝙩𝙧𝙪𝙚
 
𝙡𝙤𝙘𝙖𝙡 𝙧𝙚𝙡 = 𝙘𝙖𝙢.𝘾𝙁𝙧𝙖𝙢𝙚:𝙑𝙚𝙘𝙩𝙤𝙧𝙏𝙤𝙊𝙗𝙟𝙚𝙘𝙩𝙎𝙥𝙖𝙘𝙚(𝙝𝙪𝙢.𝙈𝙤𝙫𝙚𝘿𝙞𝙧𝙚𝙘𝙩𝙞𝙤𝙣)
𝙡𝙤𝙘𝙖𝙡 𝙧𝙖𝙬𝙑𝙚𝙡 = ((𝙘𝙖𝙢.𝘾𝙁𝙧𝙖𝙢𝙚.𝙇𝙤𝙤𝙠𝙑𝙚𝙘𝙩𝙤𝙧 * -𝙧𝙚𝙡.𝙕) + (𝙘𝙖𝙢.𝘾𝙁𝙧𝙖𝙢𝙚.𝙍𝙞𝙜𝙝𝙩𝙑𝙚𝙘𝙩𝙤𝙧 * 𝙧𝙚𝙡.𝙓) + (𝙑𝙚𝙘𝙩𝙤𝙧3.𝙣𝙚𝙬(0, 1, 0) * 𝙫𝙑𝙚𝙘𝙩))
 
𝙗𝙫.𝙑𝙚𝙡𝙤𝙘𝙞𝙩𝙮 = (𝙧𝙖𝙬𝙑𝙚𝙡.𝙈𝙖𝙜𝙣𝙞𝙩𝙪𝙙𝙚 > 0) 𝙖𝙣𝙙 (𝙧𝙖𝙬𝙑𝙚𝙡.𝙐𝙣𝙞𝙩 * (𝙛𝙡𝙮𝙎𝙥𝙚𝙚𝙙 * 25)) 𝙤𝙧 𝙑𝙚𝙘𝙩𝙤𝙧3.𝙯𝙚𝙧𝙤
 
𝙞𝙛 𝙗𝙫.𝙑𝙚𝙡𝙤𝙘𝙞𝙩𝙮.𝙈𝙖𝙜𝙣𝙞𝙩𝙪𝙙𝙚 > 0 𝙩𝙝𝙚𝙣
𝙗𝙜.𝘾𝙁𝙧𝙖𝙢𝙚 = 𝘾𝙁𝙧𝙖𝙢𝙚.𝙣𝙚𝙬(𝙑𝙚𝙘𝙩𝙤𝙧3.𝙯𝙚𝙧𝙤, 𝙗𝙫.𝙑𝙚𝙡𝙤𝙘𝙞𝙩𝙮)
𝙚𝙡𝙨𝙚
𝙗𝙜.𝘾𝙁𝙧𝙖𝙢𝙚 = 𝘾𝙁𝙧𝙖𝙢𝙚.𝙣𝙚𝙬(𝙑𝙚𝙘𝙩𝙤𝙧3.𝙯𝙚𝙧𝙤, 𝙧𝙤𝙤𝙩.𝘾𝙁𝙧𝙖𝙢𝙚.𝙇𝙤𝙤𝙠𝙑𝙚𝙘𝙩𝙤𝙧)
𝙚𝙣𝙙
 
𝙡𝙤𝙘𝙖𝙡 𝙩𝙖𝙧𝙜𝙚𝙩𝙍𝙤𝙡𝙡 = 0
𝙡𝙤𝙘𝙖𝙡 𝙖𝙘𝙩𝙞𝙫𝙚𝙇𝙚𝙧𝙥𝙎𝙥𝙚𝙚𝙙 = 𝙍𝙊𝙇𝙇_𝙎𝙋𝙀𝙀𝘿
 
𝙞𝙛 𝙧𝙖𝙬𝙑𝙚𝙡.𝙈𝙖𝙜𝙣𝙞𝙩𝙪𝙙𝙚 > 0 𝙩𝙝𝙚𝙣
𝙞𝙛 𝙢𝙖𝙩𝙝.𝙖𝙗𝙨(𝙧𝙚𝙡.𝙓) > 0.1 𝙩𝙝𝙚𝙣
𝙩𝙖𝙧𝙜𝙚𝙩𝙍𝙤𝙡𝙡 = 𝙢𝙖𝙩𝙝.𝙘𝙡𝙖𝙢𝙥(-𝙧𝙚𝙡.𝙓 * 𝙈𝘼𝙓_𝙍𝙊𝙇𝙇, -𝙈𝘼𝙓_𝙍𝙊𝙇𝙇, 𝙈𝘼𝙓_𝙍𝙊𝙇𝙇)
𝙚𝙡𝙨𝙚
𝙩𝙖𝙧𝙜𝙚𝙩𝙍𝙤𝙡𝙡 = 0
𝙚𝙣𝙙
𝙚𝙡𝙨𝙚
𝙡𝙤𝙘𝙖𝙡 𝙧𝙖𝙬𝙈𝙤𝙪𝙨𝙚𝘿𝙚𝙡𝙩𝙖 = 𝙐𝙄𝙎:𝙂𝙚𝙩𝙈𝙤𝙪𝙨𝙚𝘿𝙚𝙡𝙩𝙖()
𝙨𝙢𝙤𝙤𝙩𝙝𝙚𝙙𝙈𝙤𝙪𝙨𝙚𝙓 = 𝙨𝙢𝙤𝙤𝙩𝙝𝙚𝙙𝙈𝙤𝙪𝙨𝙚𝙓 + (𝙧𝙖𝙬𝙈𝙤𝙪𝙨𝙚𝘿𝙚𝙡𝙩𝙖.𝙓 - 𝙨𝙢𝙤𝙤𝙩𝙝𝙚𝙙𝙈𝙤𝙪𝙨𝙚𝙓) * 𝙢𝙖𝙩𝙝.𝙢𝙞𝙣(18 * 𝙙𝙩, 1)
𝙞𝙛 𝙢𝙖𝙩𝙝.𝙖𝙗𝙨(𝙨𝙢𝙤𝙤𝙩𝙝𝙚𝙙𝙈𝙤𝙪𝙨𝙚𝙓) > 0.5 𝙩𝙝𝙚𝙣
𝙩𝙖𝙧𝙜𝙚𝙩𝙍𝙤𝙡𝙡 = 𝙢𝙖𝙩𝙝.𝙘𝙡𝙖𝙢𝙥(-𝙨𝙢𝙤𝙤𝙩𝙝𝙚𝙙𝙈𝙤𝙪𝙨𝙚𝙓 * 1.8, -𝙈𝘼𝙓_𝙍𝙊𝙇𝙇, 𝙈𝘼𝙓_𝙍𝙊𝙇𝙇)
𝙚𝙡𝙨𝙚
𝙩𝙖𝙧𝙜𝙚𝙩𝙍𝙤𝙡𝙡 = 0
𝙚𝙣𝙙
𝙚𝙣𝙙
 
𝙞𝙛 𝙢𝙖𝙩𝙝.𝙖𝙗𝙨(𝙩𝙖𝙧𝙜𝙚𝙩𝙍𝙤𝙡𝙡) < 0.5 𝙩𝙝𝙚𝙣
𝙩𝙖𝙧𝙜𝙚𝙩𝙍𝙤𝙡𝙡 = 0
𝙖𝙘𝙩𝙞𝙫𝙚𝙇𝙚𝙧𝙥𝙎𝙥𝙚𝙚𝙙 = 𝘽𝘼𝙎𝙀_𝙍𝙀𝙏𝙐𝙍𝙉_𝙎𝙋𝙀𝙀𝘿 + (𝙢𝙖𝙩𝙝.𝙖𝙗𝙨(𝙘𝙪𝙧𝙧𝙚𝙣𝙩𝙍𝙤𝙡𝙡) * 0.4)
𝙚𝙣𝙙
 
𝙘𝙪𝙧𝙧𝙚𝙣𝙩𝙍𝙤𝙡𝙡 = 𝙘𝙪𝙧𝙧𝙚𝙣𝙩𝙍𝙤𝙡𝙡 + (𝙩𝙖𝙧𝙜𝙚𝙩𝙍𝙤𝙡𝙡 - 𝙘𝙪𝙧𝙧𝙚𝙣𝙩𝙍𝙤𝙡𝙡) * (1 - 𝙢𝙖𝙩𝙝.𝙚𝙭𝙥(-𝙖𝙘𝙩𝙞𝙫𝙚𝙇𝙚𝙧𝙥𝙎𝙥𝙚𝙚𝙙 * 𝙙𝙩))
𝙚𝙡𝙨𝙚
𝙘𝙪𝙧𝙧𝙚𝙣𝙩𝙍𝙤𝙡𝙡 = 𝙘𝙪𝙧𝙧𝙚𝙣𝙩𝙍𝙤𝙡𝙡 + (0 - 𝙘𝙪𝙧𝙧𝙚𝙣𝙩𝙍𝙤𝙡𝙡) * (1 - 𝙢𝙖𝙩𝙝.𝙚𝙭𝙥(-22 * 𝙙𝙩))
𝙚𝙣𝙙
 
𝙞𝙛 𝙣𝙤𝙘𝙡𝙞𝙥 𝙖𝙣𝙙 𝙘𝙝𝙖𝙧 𝙩𝙝𝙚𝙣
𝙛𝙤𝙧 _, 𝙫 𝙞𝙣 𝙥𝙖𝙞𝙧𝙨(𝙘𝙝𝙖𝙧:𝙂𝙚𝙩𝘿𝙚𝙨𝙘𝙚𝙣𝙙𝙖𝙣𝙩𝙨()) 𝙙𝙤
𝙞𝙛 𝙫:𝙄𝙨𝘼("𝘽𝙖𝙨𝙚𝙋𝙖𝙧𝙩") 𝙩𝙝𝙚𝙣
𝙫.𝘾𝙖𝙣𝘾𝙤𝙡𝙡𝙞𝙙𝙚 = 𝙛𝙖𝙡𝙨𝙚
𝙚𝙣𝙙
𝙚𝙣𝙙
𝙚𝙣𝙙
𝙚𝙣𝙙)
 
𝘾𝙤𝙣𝙣𝙚𝙘𝙩𝙞𝙤𝙣𝙨[4] = 𝙐𝙄𝙎.𝙄𝙣𝙥𝙪𝙩𝘽𝙚𝙜𝙖𝙣:𝘾𝙤𝙣𝙣𝙚𝙘𝙩(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣(𝙞𝙣𝙥𝙪𝙩, 𝙜𝙖𝙢𝙚𝙋𝙧𝙤𝙘𝙚𝙨𝙨𝙚𝙙)
𝙞𝙛 𝙣𝙤𝙩 𝙜𝙖𝙢𝙚𝙋𝙧𝙤𝙘𝙚𝙨𝙨𝙚𝙙 𝙖𝙣𝙙 𝙞𝙣𝙥𝙪𝙩.𝙆𝙚𝙮𝘾𝙤𝙙𝙚 == 𝙀𝙣𝙪𝙢.𝙆𝙚𝙮𝘾𝙤𝙙𝙚.𝙂 𝙩𝙝𝙚𝙣
𝙏𝙤𝙜𝙜𝙡𝙚𝙄𝙣𝙫𝙞𝙨()
𝙚𝙣𝙙
𝙚𝙣𝙙)
 
𝘾𝙤𝙣𝙣𝙚𝙘𝙩𝙞𝙤𝙣𝙨[5] = 𝙇𝙋.𝘾𝙝𝙖𝙧𝙖𝙘𝙩𝙚𝙧𝘼𝙙𝙙𝙚𝙙:𝘾𝙤𝙣𝙣𝙚𝙘𝙩(𝙛𝙪𝙣𝙘𝙩𝙞𝙤𝙣()
𝙩𝙖𝙨𝙠.𝙬𝙖𝙞𝙩(1)
𝙄𝙨𝙄𝙣𝙫𝙞𝙨𝙞𝙗𝙡𝙚 = 𝙛𝙖𝙡𝙨𝙚
𝙄𝙨𝙏𝙧𝙖𝙣𝙨𝙞𝙩𝙞𝙤𝙣𝙞𝙣𝙜 = 𝙛𝙖𝙡𝙨𝙚
𝙞𝙨𝙍𝙚𝙡𝙤𝙖𝙙𝙞𝙣𝙜 = 𝙛𝙖𝙡𝙨𝙚
𝙎𝙚𝙩𝙪𝙥𝘾𝙝𝙖𝙧𝙖𝙘𝙩𝙚𝙧()
𝙚𝙣𝙙)
 
𝙎𝙚𝙩𝙪𝙥𝘾𝙝𝙖𝙧𝙖𝙘𝙩𝙚𝙧()
 
_𝙂.𝘼𝙗𝙮𝙨𝙨𝘾𝙤𝙣𝙣𝙚𝙘𝙩𝙞𝙤𝙣𝙨 = 𝘾𝙤𝙣𝙣𝙚𝙘𝙩𝙞𝙤𝙣𝙨
_𝙂.𝘼𝙗𝙮𝙨𝙨𝙂𝙪𝙞 = 𝙂𝙪𝙞2
